[{"tags":["Amazon Prime Gaming"],"image":"https://nftplazas.com/wp-content/uploads/2023/12/NFT-Plazas-Blog-Post-template-800-x-380px-9-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Reflecting Amazon Prime Gaming‘s ongoing interest in the burgeoning NFT space, the e-commerce giantAmazon Prime Gamingis giving away more exclusive NFTs for popular blockchain games, includingGods UnchainedGods Unchained and Brawlers. Amazon Prime GamingPrime Gaming subscribers can seize the opportunity to claim a range of complimentary NFTs usable across various blockchain games. Within these offerings are playable characters, special outfits, and skins, presenting a valuable asset among the coveted assets for dedicated gamers. @Amazon@PrimeGaming@bc_brawlershttps://t.co/W4ibSLuPw5pic.twitter.com/Ha8u4cuJBmDecember 20, 2023Unmissable Exclusive NFT Giveaways for GamersBy continuously collaborating with prominent blockchain-based developers and studios, Prime Gaming is able to extend a generous hand to subscribers, offering an impressive suite of in-game rewards and benefits across a spectrum of NFT-empowered games: Despite being rumored to be launching its own NFT marketplace in the near future, Amazon Prime Gaming doesn’t limit itself to NFTs; it offers an array of exclusive benefits to subscribers, including free in-game content and downloadable games.Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram","react":0},{"tags":["Amazon Prime Gaming"],"image":"https://nftplazas.com/wp-content/uploads/2023/12/NFT-Plazas-Blog-Post-template-800-x-380px-9-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Reflecting Amazon Prime Gaming‘s ongoing interest in the burgeoning NFT space, the e-commerce giantAmazon Prime Gamingis giving away more exclusive NFTs for popular blockchain games, includingGods UnchainedGods Unchained and Brawlers. Amazon Prime GamingPrime Gaming subscribers can seize the opportunity to claim a range of complimentary NFTs usable across various blockchain games. Within these offerings are playable characters, special outfits, and skins, presenting a valuable asset among the coveted assets for dedicated gamers. @Amazon@PrimeGaming@bc_brawlershttps://t.co/W4ibSLuPw5pic.twitter.com/Ha8u4cuJBmDecember 20, 2023Unmissable Exclusive NFT Giveaways for GamersBy continuously collaborating with prominent blockchain-based developers and studios, Prime Gaming is able to extend a generous hand to subscribers, offering an impressive suite of in-game rewards and benefits across a spectrum of NFT-empowered games: Despite being rumored to be launching its own NFT marketplace in the near future, Amazon Prime Gaming doesn’t limit itself to NFTs; it offers an array of exclusive benefits to subscribers, including free in-game content and downloadable games.Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram","react":0},{"tags":["Illuvium"],"image":"https://nftplazas.com/wp-content/uploads/2023/12/NFT-Plazas-Blog-Post-template-800-x-380px-8-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"The celebrated AAA blockchain game IlluviumIlluvium — tightly integrated with ImmutableX — is marking its third anniversary and the success of its most recent game, “Illuvium: Beyond”, with a generous “Mint 1, Get 1 Free” NFT offer.Enticing NFT enthusiasts and collectors alike, each “D1SK” NFT possesses one Illuvitar, three accessories, and one Tier 0 Illuvitar, available until January 15.Additonally, the celebration, dubbed “Illuvitars Wave 2, Extended Run”, will feature 25 new Illuvitars and 75 accessories. @illuviumiohttps://t.co/cAmtPPdNxQpic.twitter.com/cmB1ePtIQdDecember 21, 2023Acquiring a Free Illuvium NFT + Rewardsaccessible on the Epic Games StoreWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram","react":0},{"tags":["CryptoPunks"],"image":"https://nftplazas.com/wp-content/uploads/2023/12/yuga-labs-cryptopunks-wrapper-wp-thumbnail.jpg","author":"John","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Yuga LabsCryptoPunks@0xquithttps://t.co/iybR2D6fG9December 20, 2023Why do CryptoPunks need to be wrapped?How does CryptoPunks721 change this?Want more? Connect with NFT PlazasJoin the Weekly NewsletterJoin our DiscordFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Ubisoft"],"image":"https://nftplazas.com/wp-content/uploads/2023/12/NFT-Plazas-Blog-Post-template-800-x-380px-6-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"UbisoftUbisofthas captured widespread attention by introducing “Warlord NFTs” ahead of its highly anticipated release of “Champions Tactics: Grimoria Chronicles” set for 2024.All freebie NFTsfreebie NFTswere snatched up within 20 minutes by select patrons. Since then, more than 4,000 out of the batch have been purchased on secondary marketplaces, like OpenSea. Although, it appears the majority of original collectors are retaining their Warlords for gameplay.Unveiling Champions Tactics and Warlord NFTs FervorWarlords are exclusive pixel-style champions equipped with weapons. Ubisoft has introduced an innovative feature that allows holders of a Warlord NFT in their crypto wallet to access the game’s future mints for playable in-game characters. Holders of these assets will have the privilege of minting five Champions Tactics characters at an undisclosed future date.In contrast to Warlords NFTs, the Champions Tactics game will be deployed on the Ethereum-compatible Oasys chain. It’s projected that 9,999 Warlords NFTs will be generated, with 1,000 to be gifted to the Oasys community and 999 set aside for Ubisoft’s forthcoming marketing initiatives.Ubisoft’s foray into the NFT market underscores the vast potential of intertwining gaming and blockchain technology. Given the spectacular success of the Warlord NFTs, both gamers and investors are eagerly anticipating Ubisoft’s future Champions Tactics game and NFT offerings.Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Nifty Island"],"image":"https://nftplazas.com/wp-content/uploads/2023/12/NFT-Plazas-Blog-Post-template-800-x-380px-3-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Starting the New Year with a bang, on January 17,Nifty IslandNifty Island — created by the Web3 gaming studio Nyft — is gearing up its highly anticipated Play-to-EarnPlay-to-Earngaming adventurein open beta, featuring top NFT projects. Despite prioritizinginclusivity, community integration makes Nifty Island the ideal hub for numerous NFT fans, granting them the unique opportunity to play and connect with a plethora of celebrated avatars: Azuki, Bored Apes, CloneX, CoolCats, CyberKongz, Forgotten Runes, Pudgy Penguins, and y00ts. To kick things off, a “Play-to-Airdrop campaign like no other is coming.”pic.twitter.com/HaXGjcVESdDecember 18, 2023Customize, Collaborate, and Win Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["BetFury"],"image":"https://nftplazas.com/wp-content/uploads/2023/12/NFT-Plazas-Blog-Post-template-800-x-380px-2-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"The crypto entertainment ecosystem BetFury is offering everyone the chance to win valuable rewards through “NFT LootboxesNFT Lootboxes“. Around 90% of Lootbox buyers are guaranteed the chance of winning a profitable prize, making it an opportunity not to pass by.Whether an avid crypto enthusiast, gambler, NFT collector, staker, or investor, there’s a little something for everyone. NFT Lootboxes open crypto ($ETH, $BTC, $USDT, $TRX, and $BNB), free game spins, sports bets, BetFury’s native token $BFG, and more.One of the top Lootbox rewards, however, includes the opportunity to win the rarest NFTs! Like never before, participants have the unique chance to acquirevaluable digital assetsvaluable digital assetstypically worth thousands of dollars – including wrapped Bored Apes, CryptoPunks, Azuki Originals, DeGods, Doodles, PudgyPenguins, and more – for not even a fraction of the price.#NFT#BetFury#BoredApehttps://t.co/z8mv1Z4DC7pic.twitter.com/lLBa7KlefaDecember 13, 2023The Path to Desirable Digital TriumphsThe pursuit of obtaining these captivating rewards is super straightforward. Users must go to the BetFury platform to select an alluring Lootbox. By clicking “Open”, they will get the opportunity to win big. The acquisition of spins, along with spending currency, unveils the winning probabilities. Players can then check out their triumphs via the “Bonus Cabinet”.By offering a user-friendly approach, newcomers can easily explore this vibrant Web3 world for the first time and the thrill of winning rare and desirable digital collectibles. What’s more, anyone can test out this feature using a demo spin before diving into real-money gameplay to get a feel for how it works beforehand.Additional Beauty of BetFury Besides NFT Lootboxes, BetFury features a diverse collection of more than 8,000 Slots and Original games with an industry-leading Return to Player (RTP) of up to 99.02%. Additionally, the platform hosts over 80 sports options with odds surpassing the market average and generous bonuses, like Rakeback and Cashback of up to 25%.Users must also keep an eye on the platform’s “BetFury Staking” token, withdrawing staking payouts day in and day out. But now, it’s time to step into this thrilling Web3 ecosystem to acquire high-value assets for just a few dollars through NFT Lootboxes.Win rewards via NFT Lootboxes \u003e\u003e HereHereWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Sotheby\u0027s"],"image":"https://nftplazas.com/wp-content/uploads/2023/12/NFT-Plazas-Blog-Post-template-800-x-380px-1600-%C3%97-760px-and-2-more-pages-Personal-Microsoft%E2%80%8B-Edge-18_12_2023-11_21_45.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Sotheby’sSotheby’srecently stepped into the world of Bitcoin Ordinals inscriptions. The art auction juggernaut recently presented a trifecta of pixelated “BitcoinShrooms” NFTs that astonishingly accumulated $450,000. Bitcoin Ordinals inscriptionsBitcoin Ordinals inscriptionsAmong these artistic assets — notably created by the celebrated anonymous artist “Shroomtoshi” — thecaptivating avocado image “BIP39 SEED” drew attention, fetching a striking $101,600. Another piece reminiscent of a mushroom character from the Super Mario series (“S Shroom”) then captured over $240,000. Meanwhile, the crowned mushroom dubbed “Sovereign Individual” also stood out, garnering $108,400. Sotheby’s BitcoinShrooms auction sparked tremendous enthusiasm, attracting 148 bids across the three lots and dwarfing initial expectations of $20,000 to $30,000 apiece.Remarkably, the majority of the auction’s participation came from new bidders, accounting for over two-thirds of total attendees. High Demand for Bitcoin Ordinal NFTsThe popularity of Ethereum NFTs once ruled digital asset markets, especially in relation to art. However, Bitcoin Ordinals inscriptions, devised by Casey Rodarmor on the Bitcoin blockchain, brought a refreshing perspective last year. Since, thistrend has sparked discussion within the Bitcoin community, on whether to exclude transactions tied to NFT-like inscriptions, as it veers from Bitcoin’s original purpose as a peer-to-peer payment network.Regardless, the year 2023 has been a period of immense growth for Bitcoin Ordinals, sparking a transformation in the Bitcoin blockchain space and fueling renewed interest in non-fungible collectibles. Sotheby’s recent auction’s success and the substantial interest that it generated underlines the continuous evolution of NFTs and Bitcoin Ordinals inscriptions, emphasizing the growing anticipation and excitement concerning further advancements in this compelling field.Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Rainbow"],"image":"https://nftplazas.com/wp-content/uploads/2023/12/NFT-Plazas-Blog-Post-template-800-x-380px-2023-12-13T085737.544-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"cryptocurrenciesRainbowpic.twitter.com/UsUOOGxC0bDecember 12, 2023Delving into Rainbow’s Rewarding ExperienceThe beauty of Rainbow is its inclusivity. Users that have Ethereum with any wallet will already have points waiting for them. To receive them, users must download the Rainbow Extension from their browsers or the Rainbow Mobile app for on-the-go access.Rainbow’s point system rewards numerous activities:Interested? Then keep in mind that users who are dedicated to using the platform or own Rainbow NFTs are eligible for extra points. And those that switch from MetaMask to Rainbow — especially using MetaMask’s swap feature — can earn up to 150,000 additional points. To keep in the loop with Rainbow, the platform keeps its community updated through its social media channels, where it announces point drops based on on-chain activity. It distributes points every Tuesday at 4.20 pm (ET), ensuring a regular influx of rewards for active users.Rainbow Points are just the beginning. This innovative approach to rewarding users is set to expand, bringing more fun and engagement to the Rainbow community. As more points are accumulated, more exciting opportunities and experiences are unlocked. So, start earning while enjoying the vast possibilities of Ethereum.Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Donald Trump"],"image":"https://nftplazas.com/wp-content/uploads/2023/12/NFT-Plazas-Blog-Post-template-800-x-380px-2023-12-12T152204.608-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Donald TrumpDonald Trumphas transformed a recent legal challenge into a creative marketing venture. Launched yesterday, his third batch of NFTs, dubbed “Mugshot Edition”, presents a rare opportunity to own a segment of his suit worn during his Fulton County, Georgia, arrest on August 24 — the day his widely recognized mugshot was captured.https://t.co/0TJzDIcOBPpic.twitter.com/vunSPlEY6ZDecember 12, 2023Exclusive Offers ‘Mugshot Edition’ OpensAvailable on CollectTrumpCards.com, 100,000 of these new Mugshot trading cards are up for grabs for $99 each. Notably, buyers who purchase 47 or more in one transaction will receive one of 2,024 limited edition physical cards.On top of featuring a mugshot of Trump and a fragment of his suit, these digital collectibles grant a dinner invitation with Trump at Mar-a-Lago, with 25 assets also being hand-signed by him at random. For the first 200 buyers who purchase 100 cards with cryptocurrency, an additional exclusive offer awaits: buyers will receive a distinctive NFT, two tickets to a cocktail reception with Trump prior to the dinner at Mar-a-Lago, a second physical card containing pieces of both Trump’s suit and tie and two “Commemorative Dinner” cards. The Evolution of Trump’s Digital Trading CardsTrump first delved into the NFT market in December 2022, debuting 45,000 digital trading cards, each priced at $99, featuring himself in various fantasy poses. Hisinaugural collectioninaugural collectionsold out almost instantly, generating significant secondary sales on OpenSea due to granting the chance to win prizes: dinner with Trump, a golf outing at one of his courses, and more.pic.twitter.com/yBLpn1Zb0fDecember 15, 2022However, the initial excitement waned quickly, as evidenced by a significant drop in the value of these NFTs. After an impressive $3.5 million sales peak on December 17, 2022, the secondary market sales plummeted by over 98%, with a notable decrease to $59,300 by December 28. Despite criticisms and plagiarism accusations, the floor price remained around $200, double its initial offering. Undeterred, Trump launched a second NFT collectionsecond NFT collection in April 2023, introducing an additional 47,000 trading cards. Also priced at $99, this series generated about $4.6 million in sales but saw a decline in value, with the floor price dropping below the mint price. Adversely, this release affected the value of the original series, causing a 61% price drop.Regardless of these fluctuations, both collections rapidly sold out on his very own platform at $99 per card; thus, it’s unsurprising that the ex-president is venturing into a third iteration. Interestingly, these new editions cannot be transferred until December 31, allowing collectors time until the end of the month before the market determines their actual worth.Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["FIFA"],"image":"https://nftplazas.com/wp-content/uploads/2023/12/FIFA-NFT-Drop-To-Reward-Tickets-To-2026-World-Cup-Final-wp-thumbnail.jpg","author":"John","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"FIFA+ CollectFIFA Exploring New Ways to Connect with Fans@FIFAcom@modex_tech@FIFAPlusCollecthttps://t.co/01nwAT261uDecember 11, 2023How Can I Join The Drops?Want more? Connect with NFT PlazasJoin the Weekly NewsletterJoin our DiscordFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Funko"],"image":"https://nftplazas.com/wp-content/uploads/2023/12/Disney-Joins-Funko-For-Mickey-and-Friends-NFT-Collectible-Drop-wp-thumbnail.jpg","author":"John","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"FunkoDropppSix exclusive physical collectibles are up for grabs, featuring iconic characters such as Donald Duck, Minnie Mouse and – of course – Mickey Mouse himself.https://t.co/JhCGx1tTHe@OriginalFunko#Disney#Funko#MickeyAndFriends_MarketingAsset2_v11DigitalPop#Droppppic.twitter.com/0LJN5OcpiaDecember 1, 2023Disney x Funko Exclusive To DropppWant more? Connect with NFT PlazasJoin the Weekly NewsletterJoin our DiscordFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Valeria Games"],"image":"https://nftplazas.com/wp-content/uploads/2023/12/NFT-Plazas-Blog-Post-template-800-x-380px-2023-12-11T091518.217-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"On a mission to overhaul the Web3 gaming scene,Valeria GamesValeria Gamesis bringing OG NFT brands like Bored Ape Yacht Club, Azuki and CryptoPunks, into its next venture through intellectual property (IP) deals. By merging Web3 IPs with the traditional gaming experience, the gaming studio’s upcoming mobile game and Trading Card Game (TCG) is set to feature a variety of new playable champions, each hailing from unique corners of the digital realm.As the debut date approaches, more than 20 IP deals are anticipated, each promising to add variety and depth to the gaming experience.@seedphrasepic.twitter.com/nJkxtOBTNwDecember 10, 2023Intriguing IP Collaborations on the HorizonAt the forefront of these IP partnerships is “Seedphrase”, an iconic entity in the Web3 landscape. Not only will this partnership introduce the rarest CryptoPunkrarest CryptoPunk into Valeria Games’ ecosystem, but it will also merge renowned digital art with interactive gaming experiences.Also joining the TCG is “PrepsToThePros”, bringing along the rarest PFP NFT from the Bored Ape collection. This inclusion signifies a solid commitment to the GameFi sector and integrates the distinct style and community spirit of the celebrated NFT brand.Another top player, “Grail.eth”, will enter the scene as the number one holder of Valeria, due to owning one of the rarest Spirit Azukis. This NFT is preparing to bolster the game’s narrative. Adding to the excitement, “dingaling”, otherwise known as “the floor destroyer”, will further heat up gameplay with the addition of his Fire Azuki, bringing a visually stunning and dynamic element to Valeria’s game and enhancing its aesthetics and strategy. Strategic Partnerships Empowering the Next Gaming ExperienceThe success of this upcoming journey owes much to strategic partnerships with prominent players in the blockchain industry: Polygon Labs for facilitating straightforward and seamless blockchain integration, Magic Eden for crafting a beneficial marketplace that champions creators, Dynamic for creating innovative wallet solutions for global onboarding, and Atrium for bringing the game’s storytelling to life.As a consequence, gamers globally can prepare for an innovative shift in the gaming industry. Valeria Games’ is poised to offer an unprecedented, immersive gaming experience by gathering copious Web3 companies’ IPs to enhance its gameplay initiatives. Owing to the gaming studio’s compelling alliances, the future of gaming promises to be more thrilling and cooperative than ever.Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Blur"],"image":"https://nftplazas.com/wp-content/uploads/2023/12/NFT-Plazas-Blog-Post-template-800-x-380px-95-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Blur marketplaceBlur has been overriding OpenSeaA Wider Look into NFT Market GrowthWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Casio"],"image":"https://nftplazas.com/wp-content/uploads/2023/12/NFT-Plazas-Blog-Post-template-800-x-380px-93-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Propelled by the timely success of its previous free batch of G-SHOCK assetsprevious free batch of G-SHOCK assets, CasioCasiois set to unwind another exclusive collection of G-SHOCK NFTs on December 15 — anyone’s eligible via a G-SHOCK CREATOR PASS on gshock.casio.com. The celebrated watchmaker is set to unveil 2,000 VIRTUAL G-SHOCK NFTs featuring two new, distinct styles: the VGA-001, which represents a bold, vibrant balloon-themed G-SHOCK, and the VGA-002, spotlighting a futuristic, leaf spring-orientated shock absorption system.Both versions take inspiration from Casio’s previous shock-resistant designs but in a more forward-thinking digital environment than ever before. After all, the main aim of “VIRTUAL G-SHOCK” is to engage new audiences with Generation Z through enticing virtual interactions.The Buzz Behind G-SHOCK NFTsCasio’s initial venture into the NFT world began in September 2023, launching 15,000 G-SHOCK NFTs, which were rapidly snatched up for free within just six hours. The reason behind the project’s popularity includes enabling G-SHOCK holders to enter an exciting online community on Discord, where everyone is warmly welcomed to explore new digital experiences and interactions. All holders of a G-SHOCK CREATOR PASS, which freely offers membership privileges, can gain access to a VIRTUAL G-SHOCK NFT and special projects. Much of the G-SHOCK initiative is granted through holding a CREATOR PASS. However, the NFTs provide even richer experiences, like opening collaboration opportunities regarding future designs and partaking in e-sports experiences poised to kickstart in October 2023. Note: Early adopters who were lucky enough to score one of the first-of-a-kind G-SHOCK NFTs now have exclusive privileges to purchase one of these new VIRTUAL G-SHOCK NFTs on the official G-SHOCK website. Note:Note:Casio is committed to rewarding its digital community, spotlighting the brand’s dedication to merging the tangible and virtual landscapes in the ever-expanding consumer world.Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Bioniq"],"image":"https://nftplazas.com/wp-content/uploads/2023/11/NFT-Plazas-Blog-Post-template-800-x-380px-90-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"OrdinalsBioniqTop Bitcoin and Ordinals CollectiblesWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Azuki"],"image":"https://nftplazas.com/wp-content/uploads/2023/11/NFT-Plazas-Blog-Post-template-800-x-380px-83-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Azuki DAO — the Decentralized Autonomous Organization (DAO) behind the OG NFT project — is reportedly changing its name to “Bean” as it rebrands.AzukiInterestingly, this name change represents a strategic realignment for the organization as it evolves into an intriguing meme project.AzukiPoised to be part of Blur’s latest Ethereum Layer 2 network, Blast, $10 million funding has been secured to facilitate this fascinating meme-inspired initiative, which is said to generate a significant supply of one billion tokens.Azuki DAO developers recently admitted that its latest token distribution plan isn’t up to scratch.Currently, it issues 50% of Bean tokens to Azuki DAO and 40% to the Bean Treasury. Meanwhile, the remaining 10% is reserved for the brand’s founder, “Zagabond”.A New Chapter Following Controversy The choice for Azuki DAO to embrace a new title comes on the heels of a legal dispute involving Zagabond, related to Azuki’s latest NFT collection, “ElementalsElementals.Elemental NFTs mirrored the artworks of original Azuki PFP assets. Consequently, significant monetary setbacks ensued following the project’s launch in June, costing displeased investors a total of $39 million — Azuki NFTs devalued by 44% owing to having similarities of the underwhelming endeavor. Azuki DAO initiated a lawsuit against Zagabond following this incident. However, the situation has now been rectified through the organization’s rebranding strategy.Now, as Bean sprouts with a treasury of $10 million and a billion tokens to develop, original Azuki fans can anticipate a fresh meme-centric chapter, taking inspiration from the NFT project’s highly cherished collection, which was second in line, “BEANZ”. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Socios.com"],"image":"https://nftplazas.com/wp-content/uploads/2023/11/NFT-Plazas-Blog-Post-template-800-x-380px-82-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Socios.com, an influential blockchain-powered fan engagement platform, recently rolled out a trifecta of new features to enhance innovative fan experiences in the sports landscape.Socios.comSocios.comEach new feature boosts the utility of ‘Fan Tokens’ — a digital token (NFT) that can “transform passion into extraordinary rewards” — toNFTenhance connections between fans and their favorite sports teams. NFTFan Favourite: Vote for the ‘Player of the Match’First up, ‘Fan Favourite’ amplifies fan participation during match days, building upon existing ‘Predicator’ and ‘Check-in’ features. Through this new feature, fans are empowered to vote for their favorite player of the game 15 minutes before the match ends. Once the match comes to a close, the results are revealed, with winners winning exclusive experiences as rewards. Notably, Fan Favourite is quickly garnering popularity due to giving fans the unique opportunity to honor player achievements and earn prizes. Already, more than 260,000 votes have been cast, with 57 football teams participating as a consequence. Locker Room: Unlocking Digital Assets Next up, the ‘Locker Room’ feature is one to watch out for, allowing fans to redeem one-of-a-kind digital items by “locking” their Fan Tokens. Two types of ‘Lockers’ are available: ‘The Locked Locker’ and ‘The Flexible Locker’. The former enables sports fans to redeem their rewards immediately — although Fan Tokens remain locked until the campaign concludes. The latter also gives fans the unique opportunity to unlock Fan Tokens and obtain rewards. However, there’s a catch: if opening too early, the reward may disappear. The main aim of Locker Room is to bolster the utility of Fan Tokens, providing fans with numerous rewards like virtual and tangible goods, including real-world VIP experiences and signed merchandise, provided they remain strategic and cautious.Over 3,000 users have engaged with this feature since launching, locking approximately 30,000 Fan Tokens and collecting over 25,000 virtual collectibles.Auction: Earn Exclusive MerchandiseLast but not least is the ‘Auction’ feature, spurred from the company’s ‘Get The Ball, Own The Moment’ collaboration with the professional football league competition Serie A. Through this feature, football fans can leverage Socios’ in-app currency $CHZ, to place bets on matches, potentially winning footballs and game-worn autographed jerseys depending on their results. In the near future, the Socios hopes to extend the Auction feature to all football partners and further widen the boundaries of the Fan Favourite feature to include sports like rugby and racing.Despite already having more than 2 million users across 160 nations, these new Socios features present the platform’s strong dedication to enhancing sports fandom through issuing significant rewards to users across the globe. Be more than a fan \u003e\u003e HereHereWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Blast"],"image":"https://nftplazas.com/wp-content/uploads/2023/11/NFT-Plazas-Blog-Post-template-800-x-380px-77-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"BlastBlurpic.twitter.com/fQVAQW8v06November 22, 2023An Ambitious NFT-Dedicated JourneyWhat sets Blast apart from Blur is addressing specific challenges and limitations identified in Blur and the broader NFT realm, as mentioned above. One main advantage includes whitelisted usersBlur and Blast’s Collaborative EffortsNotably, Blast is designed to support Blur with L2 solutions, creating a symbiotic relationship between both platforms. Stemming from this, on top of securing funding for Blast, Pacman also raised a substantial $40 million to bolster the Blur marketplace. November 21, 2023Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Pudgy Penguins"],"image":"https://nftplazas.com/wp-content/uploads/2023/11/NFT-Plazas-Blog-Post-template-800-x-380px-72-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"The PFP NFT powerhouse, Pudgy PenguinsPudgy Penguins, is preparing to join the annual art event ‘Miami Art Basel’ in partnership with the Ethereum scaling networkzkSynczkSyncon December 9 — the first batch of tickets just launched today via SocialPass! Taking place at the GlassBox, this annual event is a fantastic opportunity for Pudgy Penguins holders and their friends to celebrate art and technology and connect with other community members.Sponsoring the Pudgy-centric celebration are Co-Museum, Phaver, NYX, IYK, and GM.co, underscoring Pudgy Penguins’ influence in the dynamic realm of NFTs and a mutual commitment to artistic innovation.@zksyncpic.twitter.com/tPuaJrr4iNNovember 19, 2023The Finer DetailsPudgy Penguins Miami Art Basel will cater to an older audience, welcoming individuals who are 18 years or older with complimentary food and beverages. For those interested in attending, the registration process for an event ticket is straightforward on SocialPass, requiring just an email address. Currently, 33 free ‘Big Pudgy’ tickets are available for Pudgy Penguins holders and a plus one. Additionally, 16 tickets are available for Lil Pudgy holders. More tickets will become available soon. Pudgy Penguins Miami Art Basel goes beyond being an ordinary gathering; it’s a celebration of community, art, and cutting-edge innovations spurred from the NFT landscape. Keep an eye out for more details to be revealed! Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Taproot Wizards"],"image":"https://nftplazas.com/wp-content/uploads/2023/11/NFT-Plazas-Blog-Post-template-800-x-380px-71-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Taproot WizardsBitcoin and Ordinals@standardcryptopic.twitter.com/xoNho6EKhsNovember 16, 2023Equipping Bitcoin for a Flourishing Future“Bullish on Bitcoin for a decade,” Taproot Wizards is best known for its distinctive NFT collection that features wizard characters, which reflects Bitcoin’s early days as “magic internet money”.The project is at the forefront of promoting innovation for the Bitcoin protocol, enabling the funding round to bring together a top-tier team of Bitcoin developers to advance Bitcoin and Ordinals. A primary focus of this initiative is to enhance technologies like Layer-2 rollups and zero-knowledge proofs alongside the 2021 Taproot upgrade to improve BTC’s security, privacy, and efficiency. Still, the project has already contributed open-source rollup code to support scaling efforts. Furthermore, Taproot Wizards is working toward creating a comfortable, collaborative environment for Bitcoin developers, spurring them to test out new avenues on the blockchain network to enhance the coin’s versatility.In the meantime, Taproot Wizards will continue developing new Bitcoin applications — private payments, NFTs, decentralized identities, and smart contracts — with the aim of propelling Bitcoin’s evolution beyond being a digital asset.With a skilled technical team and significant financial support, Taproot Wizards’ Bitcoin funding round is primed to advance the cryptocurrency, potentially introducing an exciting new chapter of utility. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Dairy Queen"],"image":"https://nftplazas.com/wp-content/uploads/2023/11/NFT-Plazas-Blog-Post-template-800-x-380px-68-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Dairy QueenDairy Queen, a well-known American fast food brand that’s famous for its delicious soft ice cream, is whipping up a new venture — this time around, with the NFT project ‘Weirdo Ghost Gang’ from now until December 31. Following the footsteps of Bored Ape Yacht ClubBored Ape Yacht Cluband Pudgy Penguins integrating NFTs into the mainstream, this collaboration is set to transform a Dairy Queen pop-up store in Chengdu, China, into a distinctive “ghost ski resort” that features NFT-driven ski parties and merchandise until this year’s end. pic.twitter.com/PF9RrsOwDSNovember 15, 2023Dairy Queen’s NFT-Influenced Winter PartyOnce entering the doors of this ice cream haven, customers will soon notice Weird Ghost Gang’s thematic decor and co-branded goods, like trendy beanies, sticking with the winter theme, and unisex canvas bags. Although the Dairy Queen on Chunxi Road, Chengdu, is the only branch embracing the whole NFT-themed experience, its sister branch on Huaihai Middle Road, Shanghai, is also offering a “ski ghost mixing bowl” — an artistically created ice cream sundae that mirrors a ski slope garnished with crunchy treats and rich chocolate sauce. Initiatives like this — that emerge from the NFT world — symbolize a future-orientated plan to broaden revenue sources. As this year comes to a close, this exciting event stands as a shining example of how conventional businesses can thrive by adjusting to the ever-changing tastes of a tech-savvy consumer base. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Disney"],"image":"https://nftplazas.com/wp-content/uploads/2023/11/NFT-Plazas-Blog-Post-template-800-x-380px-65-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Disney and Dapper LabsDapper Labs — the masterminds behind NBA Top ShotNBA Top Shot and NFL All Day — have unveiled teaming up to create ‘Disney Pinnacle’, an exciting new NFT platform.Disney Pinnacle’s hub of digital assets takes inspiration from the popular tangible pins featuring famous Walt Disney, Pixar, and Star Wars characters and themes, which hobbyists avidly garner and trade in the real world. Following the success of Dapper Labs’ blockchain and marketplaces, the platform holding these traditionally cherished physical collectibles will be digitally available on the Flow network and via the Apple App Store by this year’s end. Innovating Traditional Pin Collecting Disney Pinnacle is an innovative, mobile-centric digital pin-collecting experience, transforming a classic hobby into a contemporary social activity. Collectors can shortly build their own collection of beloved collectibles from their smartphones wherever they go.Disney, Pixar, and Star Wars fans can anticipate gathering on the platform to trade these authentic, verified digital assets that celebrate timeless characters cherished worldwide. As collectors curate their assortments, the platform goes beyond preserving the joy of conventional pin collecting, enhancing all-time favorite collectibles with the convenience and international connectivity of the virtual age.Today’s tech-savvy generation is invited to appreciate and experience the magic of Disney and beyond in a revolutionary, interactive new way. So, join the waitlist today: disneypinnacle.com. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Degen Distillery"],"image":"https://nftplazas.com/wp-content/uploads/2023/11/NFT-Plazas-Blog-Post-template-800-x-380px-60-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Degen DistilleryDegen Distillery— a London-based innovative spirits brand — is brewing an intriguing NFT project backed by Google and BrewDog on November 15. NFT projectNFT projectBy leveraging NFTs into its business model, Degen Distillery’s flagship NFT project, ‘ORIGO Origin’, acts as the gateway to the spirit brand’s ecosystem, opening both digital and physical perks. The initial offering for ORIGO holders includes being granted Degen Distillery’s initial product: a collector’s edition bottle of vodka called ‘721’, aptly named after the number of NFTs available. Collectors can decide whether or not to keep the digital ‘Vodka 721’ asset to themselves, swap it for a physical bottle of vodka, or sell the virtual bottle to another collector for financial gain. But most importantly and revolutionary, once minting an ORIGO NFT for 0.1 ETH, collectors will have the rare opportunity to amass wealth through licensing their intellectual property (IP) rights — art, music, and technology — to co-create forthcoming Degen Distillery products. pic.twitter.com/QmeYUaroSbNovember 10, 2023Turning IP Ownership into Profitable IncomeWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Authentickator"],"image":"https://nftplazas.com/wp-content/uploads/2023/11/NFT-Plazas-Blog-Post-template-800-x-380px-48-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Authentick, the brainchild behind AuthentickatorAuthentickator — which simplifies exploring, buying, and validating digital collectibles — just unveiled raising a whopping $4 million capital led by the Singaporean venture-building platform Menyala earlier this year.On top of that, the Singaporean startup exposed its strategic partnerships with Southeast Asia’s renowned e-commerce platform Lazada, the social media behemoth TikTok, and the international e-commerce giant Shopify. All customers of these top-tier businesses can now seamlessly acquire virtual assets without common Web3 hurdles. Effortless Digital Asset AdoptionWhat sets Authentickator apart from other NFT platforms is its ability to transform such collectibles into a format suitable for widespread use. Customers across numerous sectors can acquire digital assets as they would any other item using traditional payment methods — complex blockchain-based processes, like creating a crypto wallet, are no longer necessary.Authentickator goes above and beyond. Not only does it combine Web2 and Web3 by simplifying purchasing processes for blockchain-based assets, but it leverages its very own bespoke system that merges human review and AI to verify the safety, authenticity, and compliance of these virtual possessions. As a result, the startup has garnered strategic and robust partnerships with numerous apps, games, dApps, and Metaverses, including Animoca BrandsAnimoca Brandsand The Sandbox, bolstering the overall accessibility and utility of NFTs across a multitude of online platforms and experiences. Authentick’s Road AheadNow equipped with the financial resources, Authentick has ambitious aspirations for the future. One of which includes offering exclusive opportunities via an NFT drop to business allies seeking broader reach in the Web3 domain. Additionally, this endeavor will ensure its listing on platforms worldwide. Authentickator forges the path for digital asset innovation, uplifting companies and consumers alike with the extensive advantages — real ownership, transparency, exclusivity, investment opportunities, etc. — digital collectibles bring. Follow Authentickator on Twitter \u003e\u003e HereHereWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram","react":0},{"tags":["Crossmint"],"image":"https://nftplazas.com/wp-content/uploads/2023/11/NFT-Plazas-Blog-Post-template-800-x-380px-42-1-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"In an unprecedented partnership, the professional football club AC Milan is teaming up with the on-chain financial company centered around NFTs, CrossmintCrossmint, to tokenize its iconic stadium, San Siro, for innovative Web3 fan engagement experiences.The concept is surprisingly simple yet undeniably revolutionary: fans can purchase a plot of the Milan football ground through fractionalized NFTs. When game-changing events happen on a fan’s piece of the pitch during at-home matches (goals, assists, a yellow card, etc.), they receive significant rewards: signed football shirts, VIP experiences, free match tickets and beyond. fractionalized NFTsfractionalized NFTsCredit notably goes to not just AC Milan and Crossmint, but also Polygon Labs and FANBLOCK — all collaborative efforts have played a crucial role in bringing this fandom-nurturing project to life.@crossmint@acmilanpic.twitter.com/6TIKGEUrT4November 1, 2023Strengthening Fan Engagements with NFTs The vision of this trailblazing project is to address a persistent problem sports clubs face – the ability to identify and reward devoted fans productively. Blockchain technology offers a solution to this problem. Fans can quickly receive tokens for their interactions across numerous platforms, enabling them to build loyalty scores with clubs, which they can proudly present worldwide. In turn, clubs can use these NFTs to bolster fan engagement by issuing countless privileges. Crossmint x AC Milan’s fractionalized NFTs will play a vital role in ensuring the effortless redemption of such advantages without complex integrations. The club’s partners, ticketing platforms, streaming services, etc., can all partake. For instance, the club’s bar may offer complimentary drinks to engage fans in the midst of their football pitch’s fervor, enhancing the overall ambiance of the stadium and football matches. Proven Success in Blockchain and SportsCrossmint’s partnership with AC Milan comes to light following the NFT and DeFi titan’s previous collaborations with esteemed sports institutions such as the National Basketball Association (NBA), Major League Baseball (MLB), the US Open, La Liga, Wimbledon, and iconic sports figures like Patrick Mahomes.What makes Crossmint an attractive option for Web3 initiatives is its novice-friendly wallet and seamless NFT minting infrastructure. Entities can leverage blockchain technology to enhance fan experiences and engagements without needing prior Web3 knowledge or holding crypto, masking the blockchain’s sophisticated backend from end-users. Moreover, this isn’t the first time AC Milan has touched ground in the NFT sphere. In 2022, the team barnstormed a collaboration with the Web3 e-sports platform MonkeyLeague to launch top-tier NFTs with wearable jersey counterparts on Magic Eden — the same year it signed a multi-year deal with the sports NFT pioneer Sorare. As Crossmint and AC Milan’s partnership takes form, the future of fan engagement looks more optimistic than ever. It’s time for football fans to become active participants in the success of the club they champion and witness the sports world transform through the power of boundless blockchain technology. Want more? Connect with NFT PlazasJoin the Weekly NewsletterJoin our DiscordFollow us on TwitterLike us on FacebookFollow us on Instagram","react":0},{"tags":["Yuga Labs"],"image":"https://nftplazas.com/wp-content/uploads/2023/11/NFT-Plazas-Blog-Post-template-800-x-380px-45-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Yuga LabsYuga Labs—the prominent NFT company behind remarkable projects like Bored Ape Yacht Club and CryptoPunks — is excitingly collaborating with the leading cross-chain NFT marketplace, Magic Eden, to introduce a marketplace before this year’s end. Ending 2023 on a positive note, what will set this marketplace apart from the rest is its steadfast commitment to enforcing creator royalties, pioneering as the first top-tier Ethereum marketplace to uphold such standards. pic.twitter.com/iDrBM46nHkNovember 4, 2023Overriding Creator Royalty WoesCreator royalties are an ongoing debate, spanning back as early as 2021. Industry-leading marketplaces like Blur, OpenSea, X2YE, and even Magic Eden, among others, have switched between mandatory and optional creator fees to none whatsoever.November 6, 2023Nonetheless, Yuga Labs is no stranger to advocating for royalty fees, leaving OpenSealeaving OpenSea as a consequence of the marketplace ceasing enforced creator royalties. Sticking to its guns, the Yuga Labs-developed marketplace, co-created with Magic Eden, will emphasize ownership and continuous earnings of royalties for artistic creations. Honoring royalty payments will be non-negotiable. The ecosystem will only spotlight projects that share the same principles, ensuring all creators receive fair compensation for their creative endeavors. highly anticipated marketplace is poised to set a high standard, fostering an environment that is significantly more advantageous for NFT curators. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Stepn"],"image":"https://nftplazas.com/wp-content/uploads/2023/10/NFT-Plazas-Blog-Post-template-800-x-380px-34-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Kickstarting today until November 3, Web3 pioneer and electronic music sensation Steve AokiSteve Aoki is taking strides with the ‘move-to-earn’ game, StepnStepn, launching 300 co-created Genesis Sneaker NFTs.Consisting of four unique designs — ‘Walker’, ‘Jogger’, ‘Runner’ and ‘Trainer’ — 240 of these Solana-based virtual footwear assets will be up for grabs daily through an intriguing raffle mint on the MOOAR marketplace for around $695 (3,500 $GMT).The additional Genesis Sneakers will be distributed to 60 lucky members of the DJ’s Metaverse-run membership club, ‘A0K1VERSE’. @Stepnofficial@solanapic.twitter.com/GLJK62azAZOctober 31, 2023Stepn and Aoki’s Web3 FootprintStepn, developed by Find Satoshi Lab, is a move-to-earn game that enables users to acquire NFT sneakers through their mobile devices and garner cryptocurrency, NFTs, and other rewards by taking a simple stroll or intense run. Notably, it proudly touts a substantial user base of more than 2 million monthly active users.Find Satoshi Lab is continuing to make waves in the Web3 landscape beyond linking Stepn up with Aoki, gearing up to debut its next game, ‘Gas Hero’, by this year’s end — a social adventure whereby players can plunge into a dystopian world to confront a troubled AI overlord accountable for a disastrously nuclear strike.Aoki, on the flip side, has been actively involved in numerous Web3 projects in recent years, collaborating with iconic entities like Gala Games, Decentraland, Nickelodeon, and even the celebrated comic book illustrator, Todd McFarlene (‘Spawn’). Recognizing the advantages of limitless creativity and financial gain in the Web3 realm, the pioneering DJ brought his own virtual world, A0K1VERSE, to life in 2022.Aoki and Stepn’s collaboration presents a pivotal moment whereby entertainment, gaming, and the blockchain intersect. On top of rolling out captivating Genesis Sneaker NFTs, these Web3 powerhouses illustrate what can be made possible through the synergy of notable figures and innovative blockchain-based entertainment platforms. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Bitcoin Ordinals"],"image":"https://nftplazas.com/wp-content/uploads/2023/10/NFT-Plazas-Blog-Post-template-800-x-380px-20-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Bitcoin OrdinalsBitcoin RockUnbroken Chain’s Unique Funding ApproachThe Unbroken Chain fund boldly asserts itself as the groundbreaking managed fund actively engaged in trading inscriptions and Ordinals, which encloses BRC-20 tokens, similar to ERC-2O tokens on the Ethereum network.Investments encompass a wide range of assets: Bitcoin-native tokens, unique satoshis, and distinguished inscriptions. Now operating under Unbroken Chain’s banner, these collectibles are at the forefront of the liquid trading fund, bringing sizeable capital into the Ordinals ecosystem. Not only does this groundbreaking initiative boost institutional investments in Bitcoin-based NFTs, but it also underscores what is achievable within the boundless boundaries of the blockchain-based landscape. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Bybit"],"image":"https://nftplazas.com/wp-content/uploads/2023/10/NFT-Plazas-Blog-Post-template-800-x-380px-18-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"BybitBybit, a global frontrunner in cryptocurrency exchanges, has collaborated with Made in Brazil (MIBR) to pay homage to the esports team’s remarkable two-decade presence through a distinctive NFT collection.NFT collectionNFT collectionExclusive Jerseys, Discounts and BonusesAvailable on Bybit’s effortless platform, these collectible MIBR jerseys come in varying levels of rarity. ‘Standard Editions’ are limited to 250 prints apiece, whereas ‘Ultra-Rare’ versions are restricted to just 5 copies each. Generously, 6 of these virtual assets will also be up for grabs free of charge.Those who collect the complete set of Bybit MIBR NFTs will be prized with a unique, tailor-made, autographed MIBR jersey. Fans amassing 11 NFTs, however, will be honored with a one-in-a-kind acknowledgment, a shoutout, from their favorite MIBR player. Additionally, individuals owning between 7 and 10 jerseys can enjoy MIBR store discounts along with a $BRZ bonus on Bybit. Bybit and MIBR’s Shared VisionMIBR and Bybit’s joint venture symbolizes a novel convergence of blockchain technology and esports, illustrating the intriguing overlap between NFTs and the competitive gaming realm. Bybit’s prestige as the world’s third most visited cryptocurrency exchange stands as evidence of the growing relevance of blockchain-based initiatives. Soon, the platform will become all the more appealing, presenting numerous advantages by blending esports achievements with innovative means.As we draw closer to the highly-anticipated debut date of MIBR NFTs, excitement garners between Bybit and MIBR fans. Not only do MIBR NFTs honor the esports team’s legacy, but they are a fantastic opportunity for fans to establish a new benchmark for supporter engagement.Not forgetting, thanks to Bybit’s unwavering support, MIBR’s rich history will be permanently etched into the digital world.So, engage with our sporting heroes in an exclusive, innovative fashion and reap the unmissable perks! Check out MIBR NFTs on Bybit \u003e\u003e Here HereWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["y00ts"],"image":"https://nftplazas.com/wp-content/uploads/2023/10/NFT-Plazas-Blog-Post-template-800-x-380px-11-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"y00tsinitial announcementpic.twitter.com/nLhjDD4IejOctober 16, 2023Incentivizing Early Adopters to Evolve Onboarding y00ts collectors to quickly switch from Polygon to Ethereum, the NFT project is generously covering all gas fees for first movers within the first 24 hours of viability. Further incentivizing early adoption, 10 y00ts NFTs will randomly be distributed to wallets that switch chains within the first day. Notably, such assets have a floor price of approximately $1225 (0.775 ETH), as per OpenSea.Additionally — boosting y00ts holders to act promptly in the next week — the NFT project is imposing a royalty fee of 33.3% starting October 22. Tech Boosts and Imminent Upgrades y00ts partnered with Wormhole Crypto’s cross-chain NFT standard to ease this transition, offering a safe and effective process for holders. Moreover, users can access all verified y00ts links with ease through Phantom shortcuts, including the popular bridge link.However, it’s important to note that Ethereum validation can take up to an hour before minting, with a 30 y00ts migration limit per user. The waiting room advises users to “just chill”, stating the “y00ts are in transit. You can leave this page and come back later.” In comparison, minting on Polygon is much swifter, validating such transactions within just seconds. System enhancements regarding this setback are in the works. Another critical differentiation to be aware of is that y00tpoints will operate exclusively on the Ethereum network. Staking y00ts on ETH is not necessary; just holding them in a wallet is sufficient enough.y00ts’ dedication to becoming the leading cross-chain NFT community is becoming a reality, with the goal of scaling up through Bitcoin after the Polygon and Ethereum transfer fulfillment. The overarching target of y00ts’ creators, Dust Labs, is to cultivate a diverse and thriving NFT ecosystem — one of which is readily available across a multitude of blockchain networks.Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["World of Women"],"image":"https://nftplazas.com/wp-content/uploads/2023/10/NFT-Plazas-Blog-Post-template-800-x-380px-8-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Following the footprints of Pudgy PenguinsPudgy Penguins in the retail sphere, the World of Women (WoW) has linked up with the WS Game Company to create a special edition of the cherished board game Monopoly. WoWWoWLaunching on October 17, the ‘MONOPOLY: World of Women Galaxy Edition’ — featuring WoW characters alongside other OG NFT collectibles — will be accessible for all to play with a Web3 twist. WoW holders will notably relish extra benefits.@__Talley__#MonopolyWoWGalaxypic.twitter.com/9kW5iJfkSCOctober 12, 2023Monopoly’s WoW-Enlivened Gaming ExperienceCrafted by the creative director of WoW, Yam Karkai, the physical and digital MONOPOLY: World of Women Galaxy Edition engulfs an intriguing, cosmic journey through the NFT brand’s future-oriented galaxy.Players can transport themselves into the WoW universe, collecting Ethereum-based currency along the way with their golden tokens that pay homage to the esteemed NFT brands Bored Ape Yacht Club, CryptoPunks, VeeFriends, CloneX and Cool Cats.The game’s NFT-engraved golden tokens add intrigue to the game, with the ultimate goal being to familiarize the future generation with Web3 and digital currency through gameplay.Tangible versions of the board game will be up for grabs for a short time only, and delivery orders will be made within the first eight weeks. Conversely, WoW’s platform ‘Patio’ is the central hub of the online version, providing extra benefits for engaging participants beyond issuing ETH.The MONOPOLY: World of Women Galaxy Edition not only revamps a traditional, family favorite; it pioneers new gaming territory whereby both conventional and virtual gamers can find shared excitement among the same love of Monopoly. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Binance NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/10/NFT-Plazas-Blog-Post-template-800-x-380px-2.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Teaming up with BinanceBinance yet again, Christiano Ronaldo has kickstarted a new NFT initiative, introducing 50,000 free ‘CR7 ForeverZone’ mystery boxes to old and new users of the crypto and NFT exchange behemoth.Created to bolster fan engagement, the NFT collectibles pay homage to Ronaldo’s illustrious football career, with 50,000 giveaway surprises in store, including 50 shirts and footballs signed by the legend himself.On top of that, these ‘boxes’ open more memorable experiences: 50 lucky CR7 ForeverZone collectors will be granted complimentary access to Binance Blockchain Week, taking place in Istanbul from November 8-9. Considering tickets are on sale for $450, this is an opportunity not to be missed.Above all, one NFT spotlights an in-demand ‘Golden Ticket’. A fortunate football fanatic will get the once-in-a-lifetime opportunity to join the pitch with one of the greatest players of all time — Ronaldo! #Binance#Binancehttps://t.co/1cl21YjQeJpic.twitter.com/DVlzWhbEMHOctober 11, 2023Ronaldo and Binance’s Ongoing NFT AllianceNotably, this isn’t the first time Cristiano Ronaldo has teamed up with Binance for an NFT initiative. Following a multi-year partnership between the two, the football player’s initial ‘CR7’ collectibles opened unparalleled merchandise and NFT airdrops on the Binance NFT platform in November 2022. Taking the project to the next level, Ronaldo and Binance later debuted ‘Forever CR7: The GOATForever CR7: The GOAT‘ NFTs in July 2023. Initially selling at $30 – $300 apiece (depending on the assets’ rarity), these Ronaldo-featured collectibles — like ForeverZone — unlocked a training session with the soccer star alongside autographed goods and tickets to Binance Blockchain Week. To honor these past projects, some of the recently dropped ForeverZone boxes contain exclusive NFTs from both past collections. The collective effort between Christiano Ronaldo and Binance NFT collectibles continues to push fan involvement, fusing football and Web3 to attract and appreciate international supporters — this time, as freebies! Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["CrypToadz NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/10/NFT-Plazas-Blog-Post-template-800-x-380px-3-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"In a questionable turn of events, a CrypToadz NFTCrypToadz NFT — typically marked with a price tag of around $1,000 — switched hands on OpenSeaOpenSea yesterday for a mighty $1.6 million (1,055 WETH), leading the secondary marketplace to generate $40,000 on the 2.5% transaction fee.Many NFT enthusiasts are scratching their heads concerning this transaction. Just a fortnight prior to its record-breaking sale, the CrypToadz NFT was acquired for $1,600 (0.95 ETH). The question echoing throughout the crypto sphere is, “Why?” — why would someone purchase an asset for nearly 1,000 times more than its initial cost with no apparent reason for doing so?Speculations Surrounding the Sizeable Transaction Some suspect the CrypToadz NFT transaction involves wash trading — an activity whereby someone inflates the trading price or volume of an NFT by continuously buying and selling the digital asset to fabricate a misleading impression of high value and demand.Others, on the flip side, believe it’s a “fat finger” mistake, implying the instance was led by mere oversight and plain clumsiness. pic.twitter.com/yY5WCNL6QNOctober 9, 2023Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Ecosapien NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/10/NFT-Plazas-Blog-Post-template-800-x-380px-1-scaled.jpg","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"It’s time to mark your calendars. EcosapiensEcosapiens is bringing more collectibles to life while on its mission to save the planet. Following its unique carbon-offsetting Web3 initiative, it’s dropping a free batch of the world’s first climate comic NFTs exclusively on the Polygon blockchain, ‘Leosapien’, on October 12. Within the virtual pages of Leosapien, collectors will encounter different rarities, each telling a similar story but with unique essences and values. A limited release encompasses 500 ‘Ultra Rare’ collectibles, each granting 10,000 EcoPoints, whereas 100 ‘Special’ NFTs each provide 1,000 EcoPoints. Additionally, an endless stash of ‘Common’ digital assets, each awarding 100 EcoPoints, will be up for taking.Anyone interested can win a Leosapien NFT by joining the project’s waitlist, following the official Ecosapiens Twitter account, and garnering hype surrounding the giveaway by tagging three friends in the Ecosapiens threads.  The first 1000 members on the waitlist will be prized Ultra Rare and Special Leosapien NFTs. However, considering 49691 members are already in the queue at this time of writing, why not join the frenzy for a guaranteed Common NFT with the hope of getting lucky with a Special edition?Be sure to also keep a look out for Leosapien collectibles onsecondary marketplacessecondary marketplaces after the mint date. @ecosapiensxyzhttps://t.co/urrukmQNScpic.twitter.com/cdBA3TMGpsOctober 9, 2023The Next Step in Environmental Engagements For now, details regarding the utility of Leosapien remain under wraps. All that’s known is that these digital assets play a role in the expansive Ecosapiens universe — a realm whereby tales, experiences, and characters weave together to immerse in a world where fantasy and sustainability collide.In the past, Ecosapiens has progressively merged the virtual and environmental spheres by evolving real-world carbon credits into NFTs, enabling community members to impact the environment distinctively with the helping hand of a $3.5 million funding round in April last year.Each digital item is backed with 20 metric tons of atmospheric carbon. So, when purchasing an Ecosapien, collectors offset the carbon output of valuable sources for more than a year.Claiming offsetting thousands of tons of C02 — the equivalent of planting 40,000 trees — Ecosapiens makes strides in the Web3 and ecological landscapes, providing unparalleled ways for NFT holders to support eco-friendly actions while reaping digital perks.Keeping NFT holders engaged in the act of defending the planet, Ecosapiens’ digital assets evolve through different levels, each ensuring additional carbon offsets while remaining fun and easily accessible collectibles.Now, it’s time for these Ecosapiens free NFTs to level up the ecosystem in ways soon to be unveiled. Collect these unusual CryptoArt items and show the world you care about our eco-footprint. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Pudgy Penguins"],"image":"https://nftplazas.com/wp-content/uploads/2023/10/How-Pudgy-Penguins-NFTs-Defied-the-Bear-Market-to-Flourish.png","author":"Maruf","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"The current crypto bear market has caused major turmoil to the Web3 sector, negatively impacting the the growth of many decentralized projects, including NFTs. Essentially making it very difficult for any platform or collection to gain any traction in the current climate. However, some projects are built differently and have flourished while others have floundered. One such success story comes in the shape of Pudgy Penguins NFTs. What are Pudgy Penguins NFTs?Pudgy Penguinsrepresents a collection of 8,888 collectible NFTs created on the Ethereum network in July 2021. The project was co-founded by Cole Villemain, Clayton Patterson, and two pseudonymous members (“MickyJ” and “Jonah”). The Pudgy Penguins collection is a classic PFP NFT that offers exclusive perks to its holders (dubbed “Pengus” or members of the “Huddle”), including access to events, experiences, IP licensing opportunities, and lots more. During the launch, the Pudgy Penguin NFTs minted for 0.03 ETH and swiftly sold out within 20 minutes of their release, leaving enthusiasts to seek them on secondary marketplaces like OpenSea. After launch, its average floor pricereportedlysurged from 0.04 ETH in July to 3.49 ETH in August 2021. However, its floor price declined from September to December 2021, plummeting to 0.88 ETH. This decline was associated with several allegations against the founders, including a deviation from the project’s roadmap. This development resulted in several Pengus (Pudgy Penguin holders) wrapping the Penguin NFTs onMETADROPinto a new collection, stopping them from paying royalties to the accused founders and their team. At the launch of the NFT project, its founders stated their goals, which included creating a children’s educational book on NFTs, a virtual game for the ecosystem, and a custom token for the ecosystem, among others. However, its community feared the founders were abandoning the project since nothing was forthcoming from their initial pledges. This led to a partial decline in the project’s floor price from late 2021 to early 2022.The Game ChangeWith accusations flying around on social media and its community (Twitter and Discord), Villemain and Patterson were expelled from the company in January 2022 after a Discord vote. Meanwhile, one of the Diamond hands of the PFP NFTs championing the re-balancing of the project’s initial goals was approached to buy the company at 888 ETH, which he rejected and made known in atweet threadtweet thread. However, after several buyout offers from reputable investors in the NFT space, Pudgy Penguins was sold toLuca SchnetzlerLuca Schnetzler(Netz) for 750 ETH in April 2022, relinquishing its founders.The Netz WandAmidst the unfavorable 2022 NFT market, where several NFT prices plummeted, Netz and his team managed to navigate the Penguin’s ship to a favorable course, increasing its daily sales and average price to over 3 ETH. Since then, the project has performed admirably in the bear market to reach a floor price of 5.3 ETH (as of writing).How Netz Navigated Pudgy Penguin to Stay Relevant in the Bearish Market TrendThe acquisition of Pudgy Penguins from its original founders proved to be an exciting move for Netz, his team, and the entire Pudgy Penguin community. His leadership has managed to brew lemonade from the bearish market lemon, re-establishing the project’s commitment to its goals. Netz incorporated an exciting business model from his entrepreneurial acumen, rebranding the Pudgy Penguin NFT ecosystem via the following models.Getting Back on TrackNetz and his team swiftly swung into action after acquiring Pudgy Penguins. As a result, they reactivated the project’s initial goals and proceeded to achieve them. First, Netz rebranded the company by securing and authenticating its official social media accounts on Instagram, Twitter, Discord, and TikTok. He further established the company’s brand colors, logos, voice, and typefaces and rephrased the mission statement. Within three weeks of acquisition, the company employed key team members and started rolling out content and messages to the community and prospects.Taking the Bull by the HornsNetz did not joke when hesaidtheir goal is to dominate the NFT space via innovative products, partnerships, and storytelling. On August 26, 2022, Pudgy Penguinsannouncedits plan to release the projected Penguin-themed Children’s book. The company partnered with Green Kids Club to actualize and establish its storytelling goals. Furthermore, Pudgy Penguins established theIP rightsin December 2022, allowing Pengus to use their NFTs for commercial use and earn up to a projected $500k annually. The IP rights also grant owners to sublicense their NFTs to a third party for commercial purposes. However, these rights are transferable once owners resell their NFT to another buyer.Partnership with Reputable BrandsOn February 15, 2023, Pudgy Penguinspartneredwith Hologram Labs to incorporate 3D models into Pudgy Penguins. This landmark partnership will allow Pengus to use their NFTs to create content on YouTube, TikTok, Twitch, and Vtube. It also allows owners to use their Penguins in video calls.On February 20, 2023, Pudgy Penguins alsopartneredwith Retail Monster in its bid to extend its project goals. This partnership paved the way for a novel Pudgy Penguins toy, placing Retail Monster as the official distributor when it launched. Community Meetups  Pudgy Penguins took another decisive step by organizing physical meetups for its community members in February 2023. This initiative fosters virtual and physical community bonding among its members, and it was heldin New York,Beijing,Hong Kong,Malaysia,Seoul, and Singapore. These meetups serve as a make-up for the NFT Winter Art Baseleventin December 2022. Adding More to the BaggageNetz has continued his ambition of extending the Pudgy Penguins brand beyond the NFT space. As such, the companyappliedfor trademarks in printed comic books, collectible trading cards, candy, snacks, board games, hoodies, hats, virtual goods, multimedia, and so on.Another Landmark DebutOn May 18, 2023, Pudgy Penguins unveiled itsPudgy Toys and Pudgy World, marking its debut in realm of Phygital collectibles.Phygital collectiblesPhygital collectiblesThe Pudgy World is a digital platform that connects newbies in the decentralized space to NFTs and blockchain; it is more like an introduction portal to the decentralized landscape. PMI Toys and Retail Monster distributed the physical Pudgy toys, which can be purchased from reputable stores likeAmazon. Pudgy toys are not random toys on a store shelf; they represent another classy NFT collection. Recently (on September 26, 2023) Pudgy Toys, alongside Pudgy World extended its market reach to 2,000 Walmart stores in the USA, promoting Pudgy Toys and the Pudgy Penguins to the physical world at large.2,000 Walmart stores2,000 Walmart storesUnlike botched updates to Azuki and DeGods’ NFT collections, , unveiling the toy was instrumental in surging the average floor price of Pudgy Penguins NFTs to 6.2 ETH on May 20, 2023. Pudgy Toys unlock effectively unlock both Soulbound and tradable NFTs. Furthermore, Pudgy Toys raised the bar of NFTs by incorporating physical items attached to each item; itreportedlysold over $500k in toys on Amazon in the first 2 days,claimingthe top spot ahead of other reputable brands. The Pudgy BridgeWhat is the use of an exclusive item with restriction?The Pudgy Bridge allows users to transfer the Penguins’ NFTs across multiple networks and interact with different ecosystems. Users can transfer their Pudgy Penguins NFT from the Ethereum network to Polygon via MetaMask, Coinbase wallet, or WalletConnect with the bridge.9 Million Dollars in FundingEvery investor likes putting their money in a profitable investment basket. Such was the case of the multiple investors that raised $9 million in the Pudgy Penguins seed funding in May 2023. The funding was led by 1kx, with participation from reputable brands like Big Brain Holdings, Kronos, Ethersole, LayerZero, Shima Capital, Old Fashion Research, and more.ConclusionTo maintain relevance, Netz is not slowing down at all; the Pudgy Penguin’s team keeps invigorating its community and the entire NFT space. Aside from the landmark success recorded like revitalizing the project from zero to millions of dollars, over 187k ETH total volume, growing its average floor prize from 0.04 ETH to 5.3 ETH, and seed fund investment, the company keeps unveiling new projects to grease their development gears toward projected goals. These include:Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":[],"image":"https://nftplazas.com/wp-content/uploads/2023/10/upland-nflpa.png","author":"NFT Plazas","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"UplandBundlesClick here for more informationGamificationMetaverse“NFLPA Legits in Upland keep delivering engaging digital fan experiences, bringing excitement to football fans through digital collectible trading. The fact that two full seasons of NFLPA Legits are now available in NFLPA Fan Shops on the secondary market speaks to the success of these digital collectibles within the Upland community as we enter our third year of partnership with the NFLPA.”Idan Zuckerman, Co-Founder and Co-CEO of UplandSummaryWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram","react":0},{"tags":["Starbucks NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/10/Starbucks-Integrates-NFTs-into-Pumpkin-Spice-Latte-Celebration.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Roasting trends while celebrating the Autumn season,StarbucksStarbucksushers in two decades of its Pumpkin Spice Latte by launching open-edition release NFTs of the popular beverage.The NFTs, best known as ‘Digital Stamps’, are available from October 5-9 through the coffee behemoth’s Web3 loyalty program, ‘Starbucks OdysseyStarbucks Odyssey‘, divided into four distinct categories: Whipped, Spiced, Iced and Steamed for $20 apiece.On top of owning a piece of Starbucks’ virtual memorabilia, all NFT collectors will be granted 250 Odyssey points per Stamp, opening unique tangible and virtual rewards. Additionally, dedicated enthusiasts that garner all four editions will be awarded an extra special treat, which, for now, remains under wraps.As with all perks, there’s a minor hitch: the Starbucks Pumpkin Latte NFTs are available to Odyssey members only, with the CryptoArt behind the Polygon collectibles not coming to light until after purchase on October 10.Starbuck’s Odyssey’s Pre-Brewed Privileges Starbucks first initiated its Odyssey rewards system in tandem with the NFT marketplace Nifty Gateway in 2022, opening it in beta the following December. Those interested in collecting NFTs and loyalty points that open rewards can easily sign up for access on the Starbucks Odyssey website. The primary goal behind Odyssey is for Starbucks to treat its clients with extra benefits that go beyond traditional food and beverages. Already, its Digital Stamps have unlocked numerous exclusive experiences for those involved, including digital coffee classes and a trip of a lifetime to its farm in Costa Rica. The just-launched Pumpkin Spice Latte NFTs follow Starbucks’ already existing Web3 success. In December, the coffee house distributed free NFTs to Odyssey members, with some of these Digital Stamps racking in a staggering $1,900 apiece via secondary marketplaces. The brand also debuted premium NFT Stamps in March for $100 each, which were quickly snatched up by eager coffee and NFT enthusiasts. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Boss Beauties NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/10/Boss-Beauties-Acquires-BFF-to-Endorse-Girl-Power-in-Web3.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Owing to sharing similar grounds and impressive track records, the Web3 media brand that inspires the next generation of women and girls, Boss BeautiesBoss Beauties, has officially announced the acquisition ofBFFBFF — a decentralized organization recognized for connecting individuals, particularly women and non-binary individuals, in the blockchain universe.Both Web3 powerhouses, famed for community-driven and educational initiatives through NFTs, aim to bolster their ethos through joint efforts. The central target of the acquisition is to make an extra million women excel in the blockchain ecosystem and other thriving technologies by offering reliable educational resources, owing to often finding themselves unfairly overlooked.@myBFFpic.twitter.com/mcgqdTdMHrOctober 2, 2023Merging Expertise for a Fairer, Diverse Web3 Backing Boss Beauties’ latest ambition is its influential past. The NFT project is famed for crafting a collaborative Barbie NFT projectBarbie NFT projectand bestowing $250,000 to the Barbie Dream Gap Project and the Boss Beauties Foundation. Consequently, the NFT project has a market cap of $1,562,252 (944.00 ETH) and a 24-hour trading volume that’s risen by 220.6% ($1,660.05) 1.00 ETH)) post-merger, as per CoinGecko. On the contrary, BFF has caught the eye of Web3 enthusiasts and high-profile personalities, Paris Hilton, Tyra Bands and Randi Zuckerberg, through its masterly-driven initiatives, including strategically curated educational content, immersive events, and 8,000 freebie NFTs. As of its latest data, the market capitalization of its BFF Friendship Bracelet NFTs stands at $763,428 (460.93 ETH). Since joining forces with Boss Beauties, its projects are anticipated to soar. By bringing two influential Web3 powerhouses focusing on a fairer Web3, this partnership showcases the importance of a digital future that’s available for all to have a say and make their mark. May the next generation of the internet be a safe haven for all walks of life to innovate and explore, and Boss Beauties and BFF lead the movement. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["CryptoPunks"],"image":"https://nftplazas.com/wp-content/uploads/2023/10/Filmmaker-Teases-Sneak-Peak-of-CryptoPunks-Documentary.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Visionary filmmaker, Sherone Rabinovitz, has teased an intriguing four-minute trailer of his forthcoming CryptoPunks documentary on Vimeo, unraveling the famed NFT collection’s eventful five-year journey in light of Beeple’s upcoming CryptoPunks party. Sherone RabinovitzCryptoPunksSherone RabinovitzCryptoPunksThe trailer highlights a four-minute excerpt from Rabinovitz’s 2018 interview with the original masterminds behind the pixelated project, John Watkinson and Matt Hall of Larva Labs, before the brains behind Bored Ape Yacht Club, Yuga Labs, took over the project’s IP rights in 2022.Watchers can expect to uncover critical parts of CryptoPunks’ upward trajectory before and after its IP takeover, including the project’s role during the NFT art frenzy of 2021, unique features that enhance demand, and compelling engagements from celebrities, auction houses, collaborations, and spinoff ventures.@beeple@cryptopunksnftshttps://t.co/shFcgvC4aRSeptember 28, 2023CryptoPunks’ Filmmaking Future Rabinovitz’s documentary still awaits an official debut date. Its emergence arises during a time when enthusiasm for NFT content declines. Coinbase’s Bored Ape movie is postponed owing to this reason, alongside the World of Women’s storytelling collaboration with Reese Witherspoon. Coinbase’s Bored Ape movie is postponedCoinbase’s Bored Ape movie is postponedNonetheless, the floor price of CryptoPunks remains steady since April last year, with a mighty floor price of $75,000 (45.19 ETH). In fact, Punk #1101, with three unique attributes — messy hair, a handlebar beard, and nerd glasses — sold for $100,072 (58 ETH) earlier today, according to CryptoPunks.app, presenting ongoing allure for these collectibles. So, stay alert for the upcoming launch of Rabinovitz’s documentary to explore the fascinating narrative of CryptoPunks’ legacy.Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["VeVe NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Marvel-and-Funko-Ally-to-Laud-Iron-Mans-Heritage-on-VeVe.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"VeVe#IronMan#FPN#FunkoPOPNews#Funko#POP#POPVinyl#FunkoPOP#FunkoSodapic.twitter.com/D8Z9ob3AQCSeptember 27, 2023VeVe’s Influence on Prized Collectibles The collectibles landscape is evolving both digitally and physically thanks to VeVe, which boosts fandom by enabling fans to buy, trade, and hunt down keepsakes of their favorite characters — Cookie Monster, Star Trek characters,The Little PrinceThe Little Prince and more. Further enhancing the collecting experience is VeVe’s forthcoming virtual showroom, poised to launch on the same date as its Iron Man relics. The platform aims to empower collectors to unite, discuss, and even swap items with other fellow enthusiasts as they showcase their prized digital assets through AR features and share images of their goods. Thanks to VeVe, the future of collectibles goes above and beyond possessions and becomes more about innovation, shared experiences, and a rekindled appreciation for all-time favorite characters. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Yuga Labs"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Yuga-Labs-Blocks-Mara-Trading-for-Major-NFT-Marketplaces.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Yuga LabsOpenSea have backtrackedcreator communitypic.twitter.com/J5iav8abvXSeptember 27, 2023The Creator Royalties Issue Has Only One ConclusionWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Prospective World"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Prospective-World-Levels-up-Tron-with-Innovative-M-NFT-Drop.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Prospective WorldSummon the Bull with Prospective World M-NFTsTake a look at the mint requirements \u003e\u003e HereHereWhat is an M-NFT?More to Come from Prospective WorldFollow Prospective World on Twitter \u003e\u003e HereHereCheck out the website \u003e\u003e HereHereWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["VeeFriends"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/VeeFriends-Joins-Mattel-for-Skeletor-and-Skilled-Skeleton-Alliance.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"VeeFriends@mattel@mastersofficialpic.twitter.com/7tTQLqUNxoSeptember 26, 2023VeeFriends and Mattel Continue to Innovate Through NFTsDecember 2021Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Pudgy Penguins"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Pudgy-Penguins-Debut-in-Walmart-as-NFTs-Corner-the-Retail-Sector.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Pudgy PenguinsAmazon initiative@pudgypenguinshttps://t.co/9UnJ04O0Xfhttps://t.co/zhIj2GdegBSeptember 26, 2023Pudgy NFTs Soar in Defiance of the Bear MarketDeGods and AzukiWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":[],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Fantastec-SWAP-Drafts-NFTs-to-Revolutionize-NCAA-College-Football.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Fantastec SWAPAvailable Now on Google Play and AppstoreAn Extra Bonus for NFT Plazas ReadersRedeem your excellent NFT Plazas bonus collectibles \u003e\u003e HereHereFollow Fantastec SWAP on Twitter \u003e\u003e HereHereWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Crypto.com"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Paris-Saint-Germain-and-Crypto-com-Release-Free-NFTs-for-Everyone.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Paris Saint GermainCrypto.comCrypto.com NFThttps://t.co/HlX2cjlJ1L@benny_drop@cryptocom@cryptocomnftpic.twitter.com/He5qCSfuHPSeptember 21, 2023Paris Saint Germain and Crypto.com to Reward CollectorsWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Pudgy Penguins"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Pudgy-Penguins-Boost-Engagements-Across-Malaysia-and-Beyond.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Following a three-day event highlighting its transition from the virtual realm to tangible toys in Kuala Lumpur on September 18,Pudgy PenguinsPudgy Penguinshas solidified its place in Malaysia!Pudgy Penguins’ Malaysia mission highlighted how the NFT-born brand redefines how blockchain innovation can benefit business landscapes. The event highlighted how Pudgy’s novel avenues, like enhancing IP applications and boosting consumer engagement, can benefit Malaysian businesses in the retail sector. Surpassingly, the Malaysian government and the Malaysian Digital Economy Corporation (MDEC) back such innovative endeavors.September 20, 2023Pudgy Penguins’ Business BlueprintMaking all intriguing ventures possible, Pudgy Penguins obtained an impressive $9 million in May. After this monetary injection, the NFT brand presented its commitment to amplifying its brand’s offerings, stressing the need to preserve its community’s core values with its identity. Consequently, the Pudgy team thoroughly delved into fundraising methods to identify the best approaches to position not just itself but its community for ongoing achievements — opening the stage forPudgy ToysPudgy Toys‘ introduction and expanding its Asian presence.Within the same month of receiving the capital, Pudgy Penguins entered AmazonPudgy Penguins entered Amazonwith a bang, garnering a whopping $50,000 in sales within just 48 hours of launching its physical Pudgy Toys collectibles. These cute penguin figures rapidly bestowed a prime status, above numerous international industry giants: Barbie, Lego, Pokémon, and the Transformers, among others.A few months later down the line, in August, Pudgy Penguins announced diving into Asian markets. Since then, it has entered Japan, Korea, Singapore, and, of course, Malaysia, garnering hype throughout such nations.The brand’s record-breaking debut on Amazon and recent expansion across major Asian nations present Pudgy Penguins’ potential. With the support of significant contributors — including the MDEC and Malaysian government — the brand is poised to redefine how Web3 can boost businesses across the globe, leaving penguin footprints wherever they wander.Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Moonbirds"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Moonbirds-Blast-Off-on-a-Spectacular-Mission-to-the-Moon.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"MoonbirdsSpace Blueth@moonbirdspic.twitter.com/8Oh2Jo968fSeptember 19, 2023Astro Moonbirds Join the Space Blue Lunaprise MissionMoonbirds in spaceWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Clay Nation"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Clay-Nation-to-Expand-Sonic-Hub-with-Extra-Art-and-Innovation.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Clay Nation#ClayNationpic.twitter.com/jDDW6yE51pSeptember 18, 2023Clay Nation’s Virtual PortalClay Nation’s virtual realm already consists of an avant-garde adventure dubbed ‘Sonic Sands’. Visitors can partake in captivating quests, exhilarating mini-games, and an exclusive NFT gallery through a lively marketplace. The portal to upgrade Clay Nation NFTs for Sandbox compatibility goes live at the end of this month. Clay Nation NFTs for SandboxClay Nation NFTs for SandboxSonic Sands opens a special treat for those enamored with clay: an exclusive 1×1 plot created as a concert space. Here, players can delve into Clay Nation’s digital domain, encompassed by musical tunes and hypnotic collectibles resembling enchanting crystals and fungi.Yet, at the soul of it all is ‘Musical Energy’ — a unique power source that drives all interactive escapades. This forthcoming Clay Nation Sonic Hub expansion, however, is ready to bring a fresh growth phase to the innovative project. It’s time to anticipate a transformed world created by a famed project that brings breadth and depth into an array of digital experiences. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Animoca Brands"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Animoca-Brands-and-Honda-Boost-Formula-1-Fandom-with-NFTs.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Leading Web3 titan Animoca Brands is fueling an exciting Web3 initiative with the esteemed automaker Honda, digital wallet Gryfyn, and NFT ticketing champion GET Protocol to offer Formula 1 NFTs.GryfynThese digital collectibles will be up for grabs at Tokyo’s Formula 1 (F1) Honda and Red Bull Welcome Event on September 20, and at the Japanese Grand Prix 2023 on September 21-24.GryfynAll racing fanatics attending the F1 Welcome Event can score a Honda KEY NFT by partaking in the event’s lottery or through a post-event airdrop. Additionally, attendees of the Japanese Grand Prix can redeem one by visiting the Honda booth at the Suzuka Circuit.These first time Formula 1 NFTs are not to be missed. Not only do the commemorative assets symbolize a piece of memorabilia, but they grant once-in-a-lifetime experiences and membership opportunities at Honda’s forthcoming events. All will be properly revealed once the event gears up. @animocabrandskk@Honda@gryfynapp@GetProtocolpic.twitter.com/rbaXhTfb3zSeptember 19, 2023The Web3 Powerhouses Accelerating F1 Fan EngagementNotably, Honda’s blockchain-based perks come to life courtesy of the Web3 powerhouses Animoca Brands Japan, Grfyn and GET Protocol. Grfyn, a subsidiary of Animoca Brands, plays an essential role in the venture, uniting brands with communities to combine the automaker’s vision with Animoca Brands Japan’s technological prowess. GET Protocol, however, has taken this Web3 initiative a step further. Following the success of its recent collaboration with the Dutch Grand Prix — introducing ticket-linked 2023 Zandvoort race NFTs — the digital ticketing infrastructure service is lending its talents to Honda to boost the performance of Honda KEY NFTs. 2023 Zandvoort race NFTs2023 Zandvoort race NFTsOwing to the synergy of industry giants sharing their skills to craft these Formula 1 NFTs, the future of F1 fandom is shining bright with innovative brilliance. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Stoner Cats"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/OpenSea-Blur-and-Rarible-Halt-Stoner-Cats-Trading-But-the-NFTs-Live-On.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Securities and Exchange CommissionStoner Cats NFTsSeptember 12, 2023Questions Arise Surrounding CentralizationWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Bored Ape Yacht Club"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/BAYC-to-Hit-Up-HK-for-Immersive-Yacht-Club-Open-House-Event.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Bored Ape Yacht ClubNFT brand’shttps://t.co/k9NPG1gi0Tpic.twitter.com/8Y1Q0MySKsSeptember 15, 2023Yuga-Run Sessions to Steal the BAYC ShowIn spite of these alluring choices, the knowledge sessions are what stand out among the rest. Yuga Labs leadership, alongside top BAYC representatives and Web3 pioneers, will be at the ready to share their wisdom. Poised to be the standout panel is ‘FRONT ROW TO THE FUTURE’ — a discussion about the expansive potential blockchain technology offers in the entertainment, art and fashion sectors. Web3 experts will lend their knowledge about the most successful ways to seize and navigate groundbreaking opportunities to enhance the new paradigm of the internet.On top of that, the ‘PLAYING ON THE BLOCKCHAIN’ seminar will take a good look at the Web3 gaming arena, enlightening blockchain gaming enthusiasts with news about what’s in the pipeline for Yuga’s gaming platform, Otherside, and beyond. Those wanting to monetize their digital IPs must also attend ‘PUTTING YOUR WEP3 IP TO WORK’. OthersideOthersideconverse, connect, and collaborate with an international community of like-minded individuals in HK! Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Cool Cats Macy\u0027s"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Cool-Cats-to-Fly-High-as-First-Ever-NFT-Brand-at-Macys-Parade.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Cool CatsCool Cats is gearing up to make a lasting impression at the 97th Macy’sMacy’s Thanksgiving Day Parade. Earning a place in the annals in history, the NFT brand is the first of its kind to physically grace this renowned holiday extravaganza on November 23 in the heart of New York City.The Web3 project seized the golden opportunity to spotlight itself at the world-famous parade via an online competition led by the retailer giant. Macy’s granted only one out of five NFT brands to showcase at the event, with other finalists keen on gaining mainstream recognition through the event being Boss Beauties, VeeFriends, SupDucks and gmoney.With Cool Cats winning the top spot, fans, event attendees, and passers-by can eagerly anticipate its mascot, Blue Cat, and cherished buddy, Chugs the Milk Carton, soon flying over the streets of NYC, unmissably featured on a sizeable, vibrant helium balloon.@Macyspic.twitter.com/WjoKmqTkiJSeptember 14, 2023Cool Cats’ Evolution from NFTs to RetailParade ready, Cool Cats has other exciting initiatives in the pipeline. The team behind the project, Cool Cats Group, is meticulously curating an assortment of exclusive goodies, shortly available for purchase at 11 select Macy’s stores and its online retail store, macys.com. The merchandise line includes plush and vinyl collectibles of Blue Cat, and a limited-edition Cool Cats hoodie exclusively available at Macy’s Herald Square. Accompanying digital activation features, all products have the wow factor. Cool CatsCool CatsSince debuting in 2021, Cool Cats has notably transformed from the NFT sphere into mainstream prominence through retail ventures. Earlier this summer, it was one of the first Web3-driven projects to host a booth at the Comic-Con international convention, selling branded plushes, Ledger Nanos, hats, aprons and more.Now, Macy’s annual festival is ready to witness history in the making as Cool Cats continues redefining what NFT artwork can genuinely achieve — a famed first-time celebration not to be missed. For those not lucky enough to hit up NYC for this intriguing event, the parade will stream on Peacock and air in the U.S. on NBC on the day of the event, from 9 am to noon (in all time zones). Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Nakamigos"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Nakamigos-Unveils-CLOAKS-NFTs-to-Community-Skepticism.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Nakamigoshttps://t.co/AwXsAc6UYfpic.twitter.com/YTHia2hsMFSeptember 13, 2023Eyes Roll as the Nakamigos Community Reacts with Cynicismrecent Azuki debacleWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Pudgy Penguins"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Pudgy-Penguins-Flip-DeGods-and-Azuki-as-the-NFT-Market-Breeds-Chaos.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Pudgy PenguinsPudgy Penguins Turns to Traditional Retail as Times Get Toughtoys and clothingpic.twitter.com/zDucuA2U5RSeptember 13, 2023Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Stoner Cats"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/SEC-Members-Lock-Heads-as-Stoner-Cats-Enters-its-Crosshairs.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"original launchStoner Cats NFT collectionSEC Commissioners Speak Out in Defense of NFTspic.twitter.com/w7xOCI0grvSeptember 13, 2023Stoner Cats NFTs Rally following the Latest SEC RulingWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Milady Maker"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Milady-Maker-Eyes-Vengeance-as-Rogue-Developer-Makes-off-with-Funds.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"September 11, 2023Milady Maker Sees Mixed Fortunes Throughout 2023Blur lending launchprovided by CoingeckoWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["NounsDAO NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/NounsDAO-Members-Support-Treasury-Split-Currently-Worth-18M.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Owing to many disgruntled holders leaning toward the crypto trend “rage quit,” the leading DAO-run NFT project,NounsDAONounsDAO, is on the brink of a treasury split on September 15. Rather than selling on the open market amidst the bear market, DAO members seek a more favorable rate from the project’s ETH stash, including the mysterious DCFGodDCFGod, who holds 28 Nouns.More than 333 Nouns support “forking” the NounsDAO NFTs in light of the rage quit. Therefore, 333 dissatisfied DAO members have split from the project to claim a share in the its 30,620 ETH tokens, valued at approximately $50 million. The Nouns NFT floor price currently sits at around $56,600 (36.5 ETH). So, the fork/rage quit currently holds a treasury worth a mighty $18.65 million (11,822.80 ETH). pic.twitter.com/CrkunuiKKzSeptember 10, 2023DAO Doubts and NFT Evaluations The NounsDAO treasury split showcases how DAOs can handle investor groups when doubting their project’s well-being. Such NFT projects, whereby digital assets are valued below their book value, typically appeal to activist traders wishing to exploit these overlooked collectibles.Making the treasury possible, this exit initiative was implemented recently following the DAO’s approval of an update dubbed v3. The experiment provides forking to give unsatisfied investors an easy way to get out of a low-performing project while reaping financial benefits.As numerous DAOs continue to shape the NFT realm, it’s apparent that such organization members can respond to challenges in ways that set the standard for the NFT landscape’s sustainability. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Made By Apes"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Everything-You-Should-Know-About-BAYCs-Made-by-Apes-Project.png","author":"Abdulrasaq Ariwoola","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"NFT utilities have moved from mere social media showmanship or proof of luxury. Now, they do more, offering real-world incentives for their communities. At the fore of this is Yuga Labs, the team behind NFT collections Bored Ape Yacht Club (BAYC) and Mutant Ape Yacht Club (MAYC) – some of the most renowned projects in the crypto ecosystem. Yuga LabsYuga LabsAside from the projects it has created, Yuga Labs is also known for its community-centredness. The team has, in the past, reiterated their commitment to building sustainable communities around their projects. With several of these initiatives already launched, Made by Apes is an idea motivated by the same community-centric thinking. We delve into the basics of Made by Apes in this article. What do they offer the holders, and how is it different from anything we have seen in the crypto community? Let’s find out! What is it?Made by Apes is a platform designed by Yuga Labs for holders of its BAYC and MAYC NFTs to enhance their rights, connect with other holders, and showcase their NFTs to the world. Notably, holders of these NFTs can get the “Made by Apes” logo for ideas or projects inspired by their NFT assets. Yuga Labs partnered with SaaSy Labs to record these licenses on the blockchain. As a result, BAYC members and the larger Web3 community can verify and track their ownership entirely on-chain. A BAYC NFT holder can, for example, use that NFT on a product such as a shirt, a cup, or any other merchandise. Securing a license gives them the right to display the Made by Apes logo on the product, thus adding an extra layer of credibility. To most users, acquiring these licensed products may be a way for them to connect with the Yuga Labs’ ecosystem.This is not the first time we have seen something of this nature from Yuga Labs, however. In the past, BAYC NFTs have been used in music videos, at concerts, and for event promotions. Now, with Made by Apes, the extent of rights over the NFTs has been extended further. music videosmusic videosNot only that, users can also create a distinct and verifiable identity for their products. Undoubtedly, the internet is rife with BAYC and MAYC pictures, which might make verifying authenticity hard. Worse if you are not a crypto native. With the Made by Apes, users can verify the authenticity of the logos used on the products. The verification also establishes a history of commercial use that other people can trace, alongside the ownership of the NFT. How does it work?According to information on the website, the license is a certification that the product/service provider owns or has licensed a legitimate BAYC or MAYC NFT. The primary goal is to sieve out fake NFT claims and offer more protection to consumers. The Made by Apes license is paired with a BAYC or MAYC NFT. However, the user making the request must currently hold the BAYC or MAYC NFT and connect the wallet in which it is contained. Once acquired, the license serves as proof of connection to the Ape community. Who can benefitAs mentioned above, the license is exclusively for BAYC and MAYC NFT holders. The rights enjoyed through the commercial use of the NFT are also enjoyed by the NFT holder. However, when the NFT is sold or transferred, then the licenses are terminated. It is also important to note that the licenses don’t transfer automatically to the new owner. If interested, the new owner will have to apply for new primary and product licenses.Therefore, if someone wants to get their own Made by Apes logo, then they must either own a BAYC or MAYC NFT. Popular Use CasesSince its introduction, Ape Holders have put the licenses to varying uses. Interesting projects borne of this innovation include Ape-inspired water, alcohol, entertainment, food services, and consumer packaged goods.Some holders have also used the licenses for their cannabis business, in pop culture, branded lifestyle products, storytelling, and Games. Some of the more interesting items to come out of the initiative include: All of these creative products will soon be curated in a directory called “The Bodega.” There, Yuga Labs will display the latest products crafted by the Ape community members.Final WordsThe Made by Apes license shows that the expansive Web3 space can relate and interact with the traditional world. We have already seen the application of these in projects offering both metaverse and real-world utilities. It also shows that NFT projects have to continuously innovate to improve the value and benefits their users enjoy. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["GoAgro"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/NFTs-Step-in-to-Change-the-Face-of-Croatian-Hog-Farming.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"NFT technologyBeyondiGoAgro Brings NFTs to the Croatian Farming IndustryWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["OnChainMonkey NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/OnChainMonkey-Sets-Aside-1M-to-Move-10K-NFTs-to-Bitcoin.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"OnChainMonkeyMetagoodAugust 22, 2023Overriding Bitcoin Transition HurdlesNevertheless, like all good things, there’s a catch: Metagood has its eye on a significant investment, one of which is estimated at a budget of a mighty $1 million to ensure the transformation goes smoothly, hitch-free. Plenty of intricacies are involved with switching blockchain networks, with smart contract capabilities, gas fees, token standards, metadata preservation, conservation of values, and security concerns all being complexities. However, as the technology matures, solutions advance, mitigating such challenges. Careful planning and considerations are required to transition networks, and all can be made possible with substantial funds in place. The complete switch is estimated to take a few months, but OnChainMonkey has already overcome a significant hurdle. Each OCM Genesis NFT can already be minted on Bitcoin, retaining an apparent link to its original Ethereum NFT. Holders will be granted complimentary Bitcoin Ordinal NFTs once they deactivate their Ethereum assets. Interestingly, this isn’t the first digital collectible project to turn its back on its initial chain.DeGods stepped across to the Bitcoin bridgeDeGods stepped across to the Bitcoin bridgein March, leaving Solana behind. Yuga Labs also decided to auction its limited-edition generative art project,TwelveFold, on Bitcoin over Ethereum — just to see what all the fuss is about, among others. It’s important to note that, despite of a few changes of heart, Ethereum still holds prominent ground in the NFT landscape, with transactions amounting to a hefty $236.8 million this month alone. In comparison, Bitcoin’s total undertakings are just $11.1 million.Still, OnChainMonkey is becoming a beacon for other NFT projects considering similar shifts, presenting the limitless adaptability and possibilities of the blockchain ecosystem. There’s never a dull day on-chain. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Glenfiddich NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Glenfiddich-Uncasks-First-Ever-NFT-Drop-with-BlockBar.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"GlenfiddichBlockBar@GlenfiddichSMWpic.twitter.com/MUZoWdPjDaSeptember 4, 2023Uncorking the Fine Details for Whisky LoversPerrier-JounetWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Casio NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Casio-to-Set-Its-Hands-Forward-with-Free-G-SHOCK-NFTs.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"CasioUpsides of the Free Casio NFTsLacosteAdidasWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["MoonPay"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/MoonPay-Ventures-Bolsters-Web3-Startups-with-Capital-and-Advice.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"MoonPaypic.twitter.com/DcDevCLLdwAugust 29, 2023MoonPay’s Advanced Epoch of EvolutionLaunching in the crypto heyday of 2019, MoonPay now flaunts an international footprint. The platform has remarkably formed alliances with over 500 industry players, racked in a customer base of over 5 million, made its mobile app accessible in 130 countries, and has an expensive crypto asset portfolio that any company would be chuffed to be a part of. Notably, since its inception, the leading crypto payment service has acquired top talent from Time; joined forces with top NFT marketplaces, LooksRare and Mintable; collaborated with the esteemed NFT artist and photographer Julie Pacino for an NFT-Inspired Movie; assisted toward raising awareness about Mental Health through NFTs with Alo Yoga, and more. NFTs with Alo YogaNFTs with Alo YogaAs MoonPay continues building and enhancing, it is now committed to empowering standout players in the ecosystem, enabling them to collectively work toward mass Web3 adoption by helping shape cutting-edge technologies through valuable capital and advice. MoonPay Ventures initiative for startups denotes a noteworthy shift in blockchain evolution, infusing resources and expertise necessary to bolster the next generation of the internet. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Lufthansa"],"image":"https://nftplazas.com/wp-content/uploads/2023/09/Lufthansa-Takes-to-the-Skies-with-New-Uptrip-NFT-Loyalty-Scheme.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Polygon networkUptripLufthansa Aims to Engage with Flyers on a Whole New LevelNFT powered loyalty programWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Cryptoys"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/Rarity-Meets-Disney-with-Cryptoys-Mickey-and-Friends-NFTs.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"CryptoysCryptoysis set to uplift its repertoire with a new line of digital assets, Mickey and Friends NFTs, for $39.99 apiece this September — the latest digital toys in the Cryptoyverse! Spotlighting some of Disney’s most renowned characters — Minnie Mouse, Mickey Mouse and Pluto — the NFTs will adopt Cryptoys’ pre-existing rarity structure from earlier collections: Common, Rare, Legendary, Grail and Ultra Grail levels. Each character will be up for grabs in five distinct types, corresponding to one of the rarity tiers. The latter categories are more in demand following scarcity.Not forgetting, there’s a catch: each collectible is a ‘blind box’ — collectors are none the wiser about which character they will receive until after purchase, making the fetch all the more intriguing!@Disneypic.twitter.com/2cSCFkWWIPAugust 28, 2023Cryptoys Climbing the NFT LadderPrior to its forthcoming ‘Mickey and Friends’ NFT drop, Cryptoys has already made significant strides in its flourishing NFT marketplace. The platform generates buzz and acclaim by releasing NFTs featuring some of the world’s most famous franchises in entertainment history, including Masters of the Universe, Star WarsStar Wars and Fast and Furious.Each release has been made possible through a significant $23 million funding round from heavy hitters in the technology and entertainment sectors. Led by a16z Crypto, the capital-raising phase enticed numerous influential entities: Animoca Brands, Dapper Labs, Mattel, Draper \u0026 Associates, Acrew Capital and Sound Ventures.Moreover, this significant monetary support enabled the creation of Cryptoys’ Cryptoverse, an engaging, decentralized Metaverse with eight unique zones, each offering out-of-this-world experiences. From immersive gaming to mixed-reality retail, the platform incentivizes user engagement and interactivity for all of its digital toy collectors and LAND owners. Interestingly, Cryptoys isn’t the first of its kind to explore Mickey and Friends NFTs. Its rival digital collectibles platform, VeVe, has already marked Mickey’s foray into the NFT world. However, given Cryptoys’ credentials and significant backing, this upcoming release is poised to be yet another standout edition in the NFT hub’s ever-growing portfolio.Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["VIK NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/Chiles-VIK-Uncorks-Wine-NFTs-to-Pop-Open-Tangible-Bottles.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Chile’s Viña VIKNFTsExtra Boons of Viña VIK NFTsWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Tomorrowland NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/Tomorrowland-NFTs-Amplifying-Fandom-Garner-2m.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Tomorrowland NFTspic.twitter.com/AL2GyuyNbgAugust 18, 2023NFTs Harmonize a Devoted Festival CommunityEnchantment surrounding Tomorrowland NFTs has captivated a community of super-fans, further boosting the festival’s position as a must-attend event. The NFT collection has witnessed tenfold growth, showcasing the desire for limited-edition perks and easy access granted by these digital collectibles. Tomorrowland, however, isn’t the only one of its kind utilizing NFTs to enhance fandom. Unum Festival, EXIT FestivalEXIT Festival, and Bamboozle, among others, also seamlessly integrate NFTs, and, with such significant demand, it’s no wonder why. As more NFT initiatives take center stage, the festival landscape redefines, enabling fans to partake in a new era of innovative engagements and experiences that overstep the bounds of time and space. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Grand Prix NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/NFT-Rewards-to-Gear-Up-the-Formula-1-Dutch-Grand-Prix-2023.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"The Formula 1 Heineken Dutch Grand Prix 2023Formula 1 Heineken Dutch Grand Prix 2023is not only shifting its gears on the Zandvoort racetrack but also the digital arena. Attendees taking a pitstop at the renowned racing event on August 27 can claimfree NFT rewardsfree NFT rewards. The NFTs, created in collaboration withGET Protocol, will virtually spotlight specific location points of Zandvoort. To celebrate the track’s 75th anniversary, 75 of these collectibles open extra enticing prizes.The Dutch Grand Prix confesses continuously looking for new ways to connect with fans — and what better ways? A New Driving Force Behind F1 Fan EngagementUpon acquiring a ticket, Grand Prix attendees automatically become permitted for a virtual slice of the circuit. However, the assets remain a mystery until one hour before the race kick starts. A notification regarding the launch of the assets will be pinged to all fans to keep them in the loop, providing the necessary information on collecting their winnings. On top of that, to celebrate Zandvoort’s birthday, 75 randomly selected fans will receive extra exclusive Grand Prix NFT rewards. These lucky winners will win a physical counterpart of the race track and a ticket to the Historic Grand Prix 2024. Still, they may be none the wiser about their victories until September 18, 2023. A digital wallet — automatically created for those claiming a collectible — will also open exclusive content, further underscoring the novelty and exclusivity of this enticing Web3 initiative. The Grand Prix NFT rewards presents a new era of fandom for racing enthusiasts, showcasing the event’s commitment to staying on top of digital advancements and trends, and fostering deeper connections with its ardent followers. As anticipation for the race rises, ticket buyers across the globe eagerly await their chance to retain a piece of the Circuit van Zandvoort and (hopefully) once-in-a-lifetime rewards. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Venly"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/Venly-and-FIBA-Honor-the-Basketball-World-Cup-via-NFTs.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Venly and the International Basketball Federation (FIBA) are teaming up to slam dunk a unique series of NFTs onto the Web3 SaaS platform on August 21, to garner attention surrounding the Basketball World Cup 2023. VenlyFIBAVenlyFIBAWith the famed event taking the court on August 25, these virtual goods are ready to dribble their way through the host countries – Indonesia, Japan, and the Philippines – opening four unique digital offerings:NFT Anticipation Builds as the Basketball World Cup ApproachesThe quartet of digital assets will be up for grabs on the FIBA World Cup NFT Shopify store. Minted on the Polygon network through the Shopify app, each collectible is easily accessible through a Venly Wallet. These Basketball World Cup NFTs are poised for success. Pivotal moments from NBA games previously netted more than $1 billion in sales through Top Shot NFTs. Although, the collection’s creator did face a legal dispute regarding accusations of violating US securities regulations. legal disputelegal disputeNonetheless, as the Basketball World Cup draws near, this fusion of sports, mementos, and blockchain technology presents exciting, once-in-a-lifetime opportunities to enhance basketball fandom worldwide. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Azuki NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/NFL-Star-Mahomes-and-Azuki-to-Touch-Down-NFT-Trading-Cards.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Patrick MahomesM.O.M@MuseumofMahomes@Azukipic.twitter.com/B2GZULFMPXA New Dawn of Sports Collectibles AwaitsIn March 2021, M.O.M broke records by amassing $3.7 million by selling 500 limited-edition digital collectibles showing critical moments in Mahomes’ illustrious career in under 20 minutes. Thus, these forthcoming assets are destined to shine.Moreover, this collaboration marks the NFT project’s second foray in the sports world, following gearing up an NFT initiative with Formula One’s Oracle Red Bull Racing back in 2022.NFT initiative with Formula One’s Oracle Red Bull RacingThe Azuki-themed trading cards on M.O.M are a tactful way to bring Azuki members’ faith back into the project following recent woes, enabling community members to own a unique piece of sports-related memorabilia.recent woesSo, sports-loving Azuki fans, huddle up for a game-changing meld of anime assets with athletic enthusiasm.Want more? Connect with NFT PlazasNFT initiative with Formula One’s Oracle Red Bull Racingrecent woesJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["DeGods"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/Finn-DeGods-Steps-Down-as-NFT-Prices-Take-a-Tumble.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Finn DeGodsDeGods Prices Slide as Whales Sell Off En-Masseseries III launchWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Power Ranger NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/Power-Rangers-and-Funko-Morphin-for-Digital-Pop-Series-2.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"FunkoBoom! StudiosNFThttps://t.co/tvQrPgAA99pic.twitter.com/tTdmJIUZI8August 14, 2023A First for Power Ranger CollectiblesWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["McDonald\u0027s NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/McDonalds-Expands-Its-Blockchain-Menu-with-Grimace-NFTs.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Bandwagon Labs#GRIMACE@McDonalds@TheHiddenWallspic.twitter.com/Z5U5T2sE8ZAugust 17, 2023Tucking into McDonald’s Web3 StanceGrimace NFTs aren’t the first time McDonald’s has chipped into blockchain-based initiatives. In 2021, McDonald’s China launched 188 NFTsto celebrate the brand’s 31st anniversary in The Middle Kingdom. Piggybacking on the success, the fast food chain similarly paid tribute to its popular McRib and Big Mac sandwiches through blockchain art shortly afterward. After a two-year break, McDonald’s Hong Kong broadened the brand’s Web3 horizons even further, launching an Ethereum-based game in The SandboxEthereum-based game in The Sandbox to celebrate Chicken McNugget’s 40th anniversary just last month.By dishing out McDonald’s Grimace NFTs in Singapore, Macca’s presents its dedication to staying on top of innovations and consumer preferences through more digital delights. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Base Network"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/Pixelmons-%E2%80%98Kevin-Makes-a-Triumphant-Return-on-the-Base-Network.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Onchain SummerCoinbase@Pixelmonhttps://t.co/rtvW67EzxOpic.twitter.com/mmhUbOjZXEAugust 17, 2023Kevin Goes Full Circle and Emerges as a HeroPixelmonWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["DeGods III"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/DeGods-Season-III-Faces-a-Rocky-Start-Price-Drops-50.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"DeGods Season IIIy00tspic.twitter.com/dCTfGSCFHxAugust 15, 2023Potential Hiccups in DeLabs’ StrategySeveral factors potentially triggered these downturns. First and foremost, the broader NFT market is experiencing a sizeable decline. It has been in a bear market since June 2022, raising concerns among long-term NFT investors and potential buyers since. Moreover, the DeGods III project’s Points Parlor — designed for DeGods holders to earn loyalty points in return for rewards — is facing criticisms following flaws, like lousy perks and eligibility restrictions. Additionally, y00ts switched from Polygon to Ethereum, likely disappointing fans of the former blockchain network. Notably, the project’s objective to debut Female DeGods was also postponed, with the project highlighting the need to listen to the insights of its female community members before making such steps. Yet again, showcasing the importance of community collaboration before making false promises — like Azuki’s recent snags.  Azuki’s recent snagsAzuki’s recent snagsDeLabs’ foundational intention is to overcome these obstacles and grow long-term within the scope of these challenges. Regardless of the team’s notable efforts to connect with community members and evolve imperfections, the sunken value of DeLabs’ NFTs suggest a complicated synergy between market forces, internal initiatives, and the need for adjustments to reignite drive.Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["DeGods III"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/DeGods-III-Downgrade-Designs-to-Upgrade-Community-Efforts.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Intriguingly shifting towards aesthetic simplicity, DeGods IIIavatars embrace an unusual ‘Downgrade’ design. Inspired by cherished artists like Hiroshi Nagai and Roy Lichtenstein and boards from the Web3 builder platformAre.naAre.na, the refurbished NFT collectiblesNFT collectibles are characterized by minimalist details, flat designs, and selective highlight tones to enhance depth and purity. By embracing Midjourney’s cutting-edge AI technology, DeGods has experimented with thousands of prompts for each DeGod III trait — all of which have been infused into a tool, making artificial intelligence more easily accessible to its Discord community.Another Notable Change, Despite Prior PromisesBy acknowledging the importance of community feedback, resonance, and inclusivity, the DeGods team has postponed the debut of Female DeGods, despite being promised just days ago. Still, the NFT project aims to unite efforts with women community members, listening to their insights before making significant project changes.promised just days agopromised just days agoDeGods is aware that alterations and imperfections come hand-in-hand. As the project’s team works toward creating fresher designs, they are receptive to crowdsourcing solutions to tackle layering snags.All members who notice errors within the DeGods III NFTs are encouraged to speak up through the community’s Discord channel. A New Engagement Era – ‘Points Parlor’But wait, there’s more! Long-term success through community discussion isn’t DeGods’ only focus. Launched on August 14 — alongside DeGods III Downgrade avatars — is its ‘Points Parlor, enabling DeGods holders to earn loyalty points in return for grand rewards. Hefty prizes include $DUST coins from the Season III Downgrades and brand-sponsored perks worth more than $250,000. Points Parlor also forges a connection for brands to boost their presence in the DeGods realm by strengthening engagements and creating mutual benefits. Through its creative Downgrade and Points Parlor, DeGods is transforming into a hub whereby art, community and commerce converge. Bring it on! Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Coca-Cola NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/Coinbases-OnChain-Summer-Event-Caps-Off-with-Coca-Cola-NFTs.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Coca-ColaBase@CocaColahttps://t.co/xTWyI3O7IWpic.twitter.com/9wxFgt8qOhAugust 13, 2023Breaking the Seal of Coca-Cola’s Masterpiece NFTsThe Coca-Cola NFTs stir famed artworks like Edvard Munch’s ‘The Scream’ and Johannes Vermeer’s ‘Girl with a Pearl Earing’ alongside emerging creative talents into the renowned Coca-Cola bottle. Comprising eight contrasting artworks, each piece has previously been featured in Coca-Cola’s Masterpiece Global campaign. Now, they are charting a new course as NFTs, accessible to blockchain art lovers participating in the Onchain Summer event. This isn’t the first time the soda brand has dipped into the Web3 world. Coca-Cola has its very own digital collection celebrating the LGBTQIA+ community, ‘The Coca Cola Pride CollectionThe Coca Cola Pride Collection‘, joined forces with GMUNK to debut World Cup-themed NFTs on Crypto.com, and more. Differently, however, its Masterpiece assets are a cocktail of technology, art and social interaction. NFT enthusiasts can also check out OnChain Summer for similar NFT drops, championing art, music, gaming, culture and more.So, let’s raise our glasses to a summer of renowned revelations and more digital discoveries on the Coinbase network. *All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Manchester United NFT"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/Manchester-United-Fans-Score-New-NFT-Loyalty-Scheme.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Manchester Unitedexciting Tezos partnershippic.twitter.com/lkcfgUtlQzAugust 11, 2023Grand Prizes Await Lucky ‘Collect United’ ParticipantsWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Azuki NFT Collection"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/The-Rise-and-Fall-of-the-Azuki-NFT-Collection-3.png","author":"Abdulrasaq Ariwoola","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"In a rapidly evolving ecosystem, the ability to adapt and innovate to meet modern trends is a priority. Like the age-long expression, “what goes up must come down,” the crypto ecosystem is rife with projects rising to stardom, only to eventually fall from grace. Whereas this is not always the case, here, we take a look at what happened with The Rise and Fall of the Azuki NFT Collection.Azuki NFT CollectionAzuki NFT CollectionAzuki was one of the projects that shook the crypto space in 2022. Despite a tumultuous crypto winter that ran projects down and had investors holding back their funds, Azuki managed to hold its head strong. However, in a very short space of time, the project became a shadow of its former self, lacking severely the successes that made it a wonder story in a year many may never want to remember. So what went wrong?AzukiAzukiIn this article, we take a deep dive into the Azuki collection. Projects in the crypto ecosystem die but not without reason. Azuki isn’t dead, but the project is falling fast. If it survived the crypto winter, why can’t it survive whatever hit it? More importantly, will the project survive the freefall? Let’s find out!Azuki’s RiseLaunched in January 2022, Azuki’s was one of the most successful NFT debuts ever seen. The collection, made up of 10,000 NFTs, garnered over $29 million during its release, grabbing the attention of the NFT market. At its launch, 8,700 NFTs from the collection were made available via Dutch auction on OpenSea and LooksRare, and sold out in four minutes. Achieving this was no mean feat, and as a result, garnered significant attention. One of the many things that made the collection successful was its uniqueness. The NFTs are well-detailed anime-like avatars with beautiful and stylish features. In many ways, the Azuki appealed to Web3 anime lovers and transitioned many from the Web2 space. Similarly, the collection is one of the projects pushing the frontiers of the NFT space by offering holders more utilities. As a result, Azuki holders had access to various exclusive benefits and perks. For instance, NFT holders qualified for free airdrops of other NFT collections, access to the whitelist, The Garden, and Azuki’s gamified Metaverse, Hilumia. Since its launch, the collection has generated close to a billion dollarsin trade volume, making it one of the most successful in its field. Similarly, some of its NFTs have sold for seven figures. According to data from DappRadar’s NFT Ranking, the highest Azuki ever sold is Azuki #9605, worth $1.42 million at the time of purchase. Rug Pulls?One of the earliest issues Azuki faced was a controversy that stirred up in May 2022. Zagabond, the founder of Azuki, revealed that he was behind three projects: Tendies, CryptoPhunks, and CryptoZunks.While it is not uncommon for project founders to be involved with multiple projects, what made it an issue was that CryptoPhunks was considered a rug pull after the team disappeared. As a result of his announcement, the project’s floor price dropped from 19ETH to 10.5ETH. This sudden drop caused panic among Azuki holders due to spreading fear of a possible rug pull. Surprisingly, the project escaped unscathed, although worries remain regarding the alleged dishonest behavior of Azuki’s founder. If anything is certain, the publicity around the issue created an impression of the project. Even though Azuki went on a great run for the remainder of the year, many holders cautiously held on.  Azuki Elementals LaunchWith the CryptoPhunk controversy a year in the past, and following an impressive innovative expansion of the Azuki ecosystem, the project was flying high. As a follow-up to several other projects and launches, the team in June announced the launch of a new NFT collection, Elementals. Elementals was to be to Azuki what the Mutant Ape Yacht Club (MAYC) is to the BAYC collection – a new set of NFTs inspired by an already successful project. However, following a successful and expensive sale, the Elemental’s launch wasn’t met with the same excitement similar projects enjoyed for apparent reasons. The 20,000 NFT collection had striking similarities with their Azuki counterparts, with only mere differences. As though that wasn’t enough, the launch was tainted with technical issues and questionable mint mechanisms. As a result, the Azuki Elementals experienced a significant drop in demand, as many holders started selling their NFTs. Data from OpenSea show that the collection currently has a floor price of 0.6ETH, a far cry from its mint price of 2 ETH. That means many holders who bought at launch are holding or have had to sell at a significant loss. The awful performance of the collection also seeped into the Azuki and Beanz NFT collections, with both recording significant declines in their floor prices. Will Azuki Survive the freefall?Trust and value are two integral elements in a vastly decentralized and anonymous ecosystem. This is especially true for Bluechips NFT collections worth thousands of dollars, which could go down the drain instantly. While many people are in the space for the exciting possibilities of Web3, a significant portion are also in for the chance to make a quick buck or double their wealth. Hence, securing their asset then becomes a top priority. Azuki has everything it takes to be a collection that lives into the future, while several innovative changes the Azukiverse has made since its launch show that it is striving to adapt to time. However, the revolutionary aspect of a project ranks second to its transparency. Users and investors need the assurance that their assets are protected and secured. In ensuring that, any blemish, no matter how small or distant, holds heavy in their decisions. Azuki tells us a story that the community-centric Web3 space is an all-embracing platform where anyone and any project can be the next star of the show. In the same way, anyone and any project, regardless of status, could face downfall at the flip of a bad decision. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["y00ts"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/DeLabs-Offers-a-Triple-Treat-Amid-Y00ts-Latest-Chain-Switch.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"y00tsDeGodsNFTspic.twitter.com/SMp4zj0jclAugust 9, 2023A Look into y00ts Migrationy00ts has been going hopping through chains recently. In April, the NFT project transitioned from Solana to Polygon, with 11,633 out of the project 15,000 making the switch. Although y00ts claims to still “love Polygon”, the moment has come to merge y00ts and DeGods. Displaying an act of honesty, the y00ts team declared it would hand back a $3 million grant previously secured by Polygon Labs in January to assist the project’s transition. The funds can now be reinvested to bolster the NFT ecosystem and support creators and builders on Polygon instead.The community’s feedback has been mixed. Some notable NFT figures in the Web3 area are rallying behind the founder of the NFT project, FrankDeGods, whereby others are voicing their concerns about the health of Polygon’s NFT environment.DeGods III NFTs and Points ParlorAdding to the excitement of DeLabs’ y00ts chain switch is DeGods Season III, introducing 20,000 new NFTs to the world of blockchain art with “no dilution”. Each DeGod comprises four unique pieces, each presenting a female avatar. Collectors can exchange the NFTs at a 1:1 ratio in return for a male counterpart, revealing a new perspective to the Season III avatars.  Valuing community suggestions, all unwanted traits have been rooted out, showcasing DeLabs’ loyalty to foster user-orientated enhancements. The recently introduced NFTs have innovative traits, poses, enhanced shading, refined designs and vibrant colors. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Pudgy Penguins"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/Pudgy-Penguins-to-Soar-with-a-Fresh-Batch-of-Childrens-Toys.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Pudgy PenguinsNFTNTWRK’s@NTWRKLIVE@sasom_officialpic.twitter.com/qEpePVrN3kAugust 7, 2023Pudgy Penguins’ Merchandise SpectrumAlready, Pudgy Penguins children’s toys have made waves on AmazonPudgy Penguins children’s toys have made waves on Amazon. Within 48 hours of launching its first batch of vinyl and plush toys on the internationally recognized marketplace, a staggering 20k were dispatched, bringing in around half a million USD. The project launch boosted Pudgys’ state-of-the-art IP and even overshadowed Amazon powerhouses like Disney, the Transformers, Barbie, and Lego.In tandem with the merchandise are redeemable ‘digital experience codes,’ which bring the toy collectors into ‘Pudgy World’. Once scanning the label, collectors can immerse themselves into the realm of these cute Antarctic creatures and partake in numerous community-centric online activities.The success of these material possessions propelled the Pudgys’ NFT domain, with the lowest-price NFT almost instantly witnessing an upswing of 22%, soaring from $8,800 (4.85 ETH) to around $10,000 (5.95 ETH). Pudgy Penguins’ floor price currently stands at $7,679.67 (4.2 ETH), as per CoinGecko.Although some skeptics raise concerns about the ethics of introducing children’s products that require a crypto wallet to take full advantage of the brand experience, Pudgy Penguins continue to weave mainstream collectors’ into its cutting-edge universe on the blockchain through such item types. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Azuki NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/NFT-Trader-Tricks-Copycat-Bot-Into-Buying-1-5m-of-Azuki-NFTs.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Blur NFT marketplaceHanwe Changpic.twitter.com/KlaXKUFUBKAugust 5, 2023Chang’s Misleading Bidding MethodA Fraudulent or Fair Strategy? thoseAugust 5, 2023However, in the unfolding of the drama, NFT enthusiasts, including a “lawyerlawyer“, publicly weighed in on the status, underscoring that, despite feeling wronged, they had made a legitimate, lawfully accepted offer. On the other hand, other users have criticized Chang’s method, warning others against discussing fraudulent practices online and referring to Chang’s money-making strategy as “illegal market activity”. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":[],"image":"https://nftplazas.com/wp-content/uploads/2023/08/Beeple-Summons-his-Inner-Clown-with-Audacious-CryptoPunk-Purchase.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"BeepleCryptoPunk #4593pic.twitter.com/3kkyLxyfbmAugust 2, 2023Beeple Spends Big to Enter the World of CryptoPunk NFTscryptoart sceneWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Starbucks NFT"],"image":"https://nftplazas.com/wp-content/uploads/2023/08/Starbucks-Pays-Tribute-to-a-Coffee-Icon-in-the-Green-Apron-Collection.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"StarbucksNiftyGateway marketplaceStarbucks Green Apron NFTs Go Beyond Mere CollectiblesRedditWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["FILT3R"],"image":"https://nftplazas.com/wp-content/uploads/2023/07/FILT3R-Takes-the-Bored-Apes-on-a-Joyride-Through-AR.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"FILT3RBAYC7621555 Genesis NFTs to Kickstart the FILT3R AR Revolutionbored.filt3r.ioBAYC NFTs Come Alive in the FILT3R EnvironmentAugmented Reality NFTs to Change Digital Identity Politics ForeverFollow FILT3R on Twitter \u003e\u003e HereHereLearn more about BAYC on FILT3R \u003e\u003e HereHereWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Sky Mavis"],"image":"https://nftplazas.com/wp-content/uploads/2023/07/Sky-Mavis-and-CyberKongz-Unite-to-Amplify-Gamified-NFTs.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Sky MavisCyberKongzMavis Market@Ronin_Networkpic.twitter.com/tY9aPoFZDqJuly 25, 2023Expanding Market Reach and Innovating Web3 IP Sky Mavis and CyberKongz collaboration align with their strategic ambitions for establishing the Ronin network as the golden benchmark in blockchain gaming.Genkai NFTs are a vital aspect of the partnership, marking a significant milestone for CyberKongz to establish itself as a top-performing blockchain platform throughout Southeast Asia and Japan. CyberKongz will shield Genkai mint transactions using the ERC-721x smart contract, a prominent step in preventing unauthorized digital asset movements and intensifying user experience.Entering CyberKongz’s Play \u0026 Kollect project on Ronin simplifies access to core gaming communities and facilitates transactions without steep gas fees. However, this alliance’s main aim is to innovate Web3 IP with a gamified twist, to raise the bar in the world of blockchain gaming.Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Stan Lee NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/07/Kartoon-Studios-Stan-Lee-NFTs-Fly-Off-the-Shelves.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Renowned entertainment hub, Kartoon Studios, recently plugged into the famed NFT marketplace VeVe to honor the iconic cartoonist Stan Lee on what would have been his 100th birthday. The first phase of these NFTs sold out in a flash, featuring Lee’s cherished creations: Spider-Man, Iron Man and the Hulk. Kartoon StudiosVeVeKartoon StudiosVeVeSelling like hot cakes at just $15 each, the demand was so high that 8,294 digital artifacts sold out almost instantaneously, racking in a staggering revenue of $120,000. The digital collectibles are now being sold on secondary marketplaces starting at $81 to a not-so-cheap $749, increasing the project’s floor price by an astonishing 466%. https://t.co/h71JLsmdog$TOON#KartoonStudiosJuly 24, 2023The NFT World’s Shining Luminary In the evolving blockchain landscape, the NFT realm has been facing numerous hurdles. Despite Bitcoin witnessing a value increase of 76% this year, NFTs are charting a less booming trajectory. The most significant market value for NFTs, illustrated by CryptoPunks, has a modest increase of just 19%, per CoinGecko. CryptoPunksCryptoPunksMoreover, Bitcoin’s current trading price is a low $29,122, showcasing the fickle nature of digital assets on-chain. Amid this volatile environment, a particular area of the NFT space shows outstanding resilience — Stan Lee NFTs. These digital collectibles represent popular culture icons, underlining the appeal of virtual collectibles linked to cherished charcters and pastimes.Regardless of seemingly discouraging market trends, the continued call for these types of assets indicates promising prospects for NFT enthusiasts. Kartoon Studios’ Stan Lee NFTs serve as a guiding light, gearing potential new directions for future blockchain-based initiatives. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Cool Cats NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/07/Cool-Cats-Pounce-into-the-Spotlight-with-Reddit-Gen-4-Avatars.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Reddit Gen 4 Avatars are getting ready to launch, despite facing criticism from the crypto community. In a bid for the NFT project to claw its way back into fame, Cool Cats are scratching a facet of intrigue into the collectibles. Reddit Gen 4 AvatarsCool CatsReddit Gen 4 AvatarsCool CatsWith prices set to fluctuate from $4.99 – $199.99, these Cool Cat-featured avatars are ready to add another captivating level of digital ownership, redefining how users interact and present their digital selves. Note:Note: the most distinguished avatars, numbered 75-125, are the most desirable collectors’ items, infusing an extra touch of exclusivity. @Reddit#RedditCollectiblespic.twitter.com/qMkSY0vpW2July 25, 2023Reddit Fights Back with Cool CatsPreviously, Reddit has been facing criticism regarding user experience, spanning from bot activity to interface issues. Fighting back, the social media platform promises a smooth process for all NFT collectors this time around. Regardless of these past woes, Cool Cats is fueling hype surrounding the Reddit Gen 4 Avatar collection. The highly-reputable blue-chip NFT collection — with some collectibles selling for six figures apiece — sparks a fresh wave of excitement and anticipation among Web3 enthusiasts, potentially giving Reddit another taste of its heyday and boosting its own brand’s credit. heydayheydaypic.twitter.com/kUu4wh6rVnJuly 25, 2023Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Ducati NFT"],"image":"https://nftplazas.com/wp-content/uploads/2023/07/Ducati-Races-into-NFTs-via-the-XRP-Ledger-Speedway-2.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"DucatiWeb3 Pro#Web3@Web3Pro_@Ripplehttps://t.co/eFRTFwdvWTpic.twitter.com/IWAHbM1WfyJuly 20, 2023The XRP Ledger Continues to Carve a Place in the NFT Industrycollectibles infrastructureWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["VeeFriends"],"image":"https://nftplazas.com/wp-content/uploads/2023/07/Veefriends-Strikes-a-Formidable-Partnership-with-the-Jazwares-Toy-Empire.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"VeefriendsJazwarespic.twitter.com/XACW8GUAE2July 24, 2023Veefriends Continues to Reward its Collectorslatest NFT collectionWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Graham\u0027s"],"image":"https://nftplazas.com/wp-content/uploads/2023/07/Grahams-Port-Pours-its-Way-into-the-NFT-Realm.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Graham’sNFT realmpic.twitter.com/3lSPOdIE2TJuly 24, 20236 Bottles of Graham’s Port Venture Farther AfieldClub dVINWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Moonbirds"],"image":"https://nftplazas.com/wp-content/uploads/2023/07/Moonbirds-Mythics-NFT-Collection-Begins-to-Take-Flight.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Moonbirdsbotched Azuki Elementals dropMoonbirds Mythics Selection Remains in the Lap of the Godsnominated OdditiesWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["MetaGuardians"],"image":"https://nftplazas.com/wp-content/uploads/2023/07/DeAPlaneta-Unleashes-NFT-Power-with-MetaGuardians-Comics.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Leading entertainment hub, DeAPlaneta Entertainment, is unmasking its recently acquired famed Metaverse superheroes, MetaGuardians, in a series of NFT comics fromDeAPlaneta EntertainmentMetaGuardiansNFT comicsDeAPlaneta EntertainmentMetaGuardiansNFT comicsA Sneak Peek into MetaGuardians’ NFT Comicscollaboration and approval of the original creators of MetaGuardiansAntubel MoredaPlants vs. ZombiesBejeweledZombie Gunship SurvivalBernal MoredaKiefer Johnston (MaestroH on Discord)MetaGuardians Draws on the Engagement of its CommunityThe inaugural release will offer 3,000 limited-edition virtual English copies of the comic, priced at around €50 (0.029 ETH) each. Further shaping the MetaGuardians NFT comics is a uniquely generated cover, numerous formats and media, and a level mode that changes depending on the amount of NFT comics collectors purchase.DeAPlaneta Entertainment already produces and manages iconic brands like Heidi, Milo, Maya the Bee, and Miraculous Ladybug, creating fascinating content and stories for a varied viewership. Showing willingness to push boundaries, the entertainment company is exploring new territories with its first MetaGuardians ‘Volume 1 – The Nexus’ comic, which is already highly-anticipated by Web3 enthusiasts. Follow MetaGuardians on Twitter \u003e\u003e HereHereWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Opepen Edition NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/07/Crypto-Twitter-Generates-Buzz-for-Opepen-Edition-NFTs.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"A Pepe meme-influenced Ethereum NFT collection, ‘Opepen Edition‘, initially curated by graphic artist Jack Butcher, experienced a notable rise in worth and acclaim spurred by social media hype this week. Ethereum NFTOpepen EditionEthereum NFTOpepen EditionRaising from around $894.39 (0.47 ETH) to approximately $1712 (0.90 ETH) in just five days (despite initially being distributed for free), the floor price of the Opepen collectibles now stands at $1541.39 (0.81 ETH), according to CoinGecko — and its all thanks to an act of kindness. Beauty of the Crypto Twitter CommunityInterestingly, the initial buzz surrounding these Opepen Edition NFTs boiled down to a playful rivalry between two Web3 influences, ‘Bored Elon Music’ and ‘ThreadGuy‘. Bored — an active supporter of Butcher’s digital artworks and the top owner of Opepen NFTs — suggested swapping one of his Opepen collectibles, which happened to be one of the first of its kind, to ThreadGuy in return for one of his Mutant Ape Yacht Club NFTs. Although the deal fell through, this small conversation instigated a larger incident. Butcher created a customized batch of 42,000 Opepen NFTs on Zora that mirror the colors of ThreadGuys Mutant Ape, issuing ThreadGuy one of the assets for free and $2 from the proceeds of each asset. Stoked by his kindness, the recipient immediately switched his Twitter PFP to his new custom image, fueling fascination within the Crypto Twitter world.July 13, 2023Since Sunday, the original Opepen Edition NFTs have been referenced, advocated, and adopted by tons of top-tier celebrities and projects in the Web3 realm, including the renowned NFT marketplaces OpenSea and Rarible, who embraced the craze by showing off the avatars as Twitter PFPs.The world-famous digital artist Beeple also paid tribute to the unity by posting numerous digital compositions surrounding the selfless gesture: pic.twitter.com/5buTkIVQssJuly 17, 2023Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Amazing Thailand NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/07/Amazing-Thailand-Returns-for-a-Third-NFT-Packed-Tourist-Season.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"nation of Thailandhas returnedrdAmazing Thailand NFTs Succeed in a Difficult MarketWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Google Play"],"image":"https://nftplazas.com/wp-content/uploads/2023/07/Google-Play-Amends-Guidelines-for-NFT-App-Integration.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Google Play strives toward a significant policy change that can greatly enhance the NFT realm. The Android app store has finally revealed plans to enable developers to integrate digital assets within games and applications.Google PlayNFT realmGoogle PlayNFT realmThe updated contract states that businesses will soon be able to provide tokenized asset transactions to expose their blockchain presence via Google’s Play Console, empowering collaborators to reassess traditional games with user-owned content and enhance user loyalty with exclusive NFT rewards. One notable collaborator behind this regulatory change is Reddit, best known for success in the NFT realm through its Avatar collectibles and marketplace. The Senior Engineer Manager of the social media hub recently highlighted that the upgraded guidelines aim to be “a fair playground that nurtures user trust and encourages responsible blockchain technology use.”Avatar collectibles and marketplaceAvatar collectibles and marketplaceGoogle Play’s Change of HeartGoogle’s take on blockchain-based apps has recently been non-transparent, stating that “developers should not advertise or glorify any potential earnings from gaming or trading activities.” This also aligns with Google Play’s policy regarding real-money games, contests and gambling, previously claiming that apps that don’t meet such eligibility requirements cannot support in-game items, like a ‘Loot Box’ for players to win NFTs. In spite of these earlier requirements, it’s apparent that the app store has had a change of heart toward Web3 initiatives. The reasons behind this bold statement include providing the decentralized data storage app ArDrive Mobile with a spot in Google Store in 2022. The platform then listed ‘Axie Infinity: Origins’ in selected Google Play markets, followed by Google Cloud debuting a Web3 scheme in April 2023 to accelerate blockchain startups. April 25, 2023Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Cool Cats NFT"],"image":"https://nftplazas.com/wp-content/uploads/2023/07/Cool-Cats-Strengthens-its-Brand-with-a-trio-of-Casual-Gaming-Titles.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Cool Catsfeeling the heatpic.twitter.com/DTsfx3pfQbJune 28, 2023Cool Cats Takes Great Strides with a Host of Strategic Partnershipspartnered with FutureverseWant more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["7-Eleven NFTs"],"image":"https://nftplazas.com/wp-content/uploads/2023/07/7-Eleven-Dispenses-a-New-Flavor-of-NFTs-via-Digital-Slurpees.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"7-ElevenNFTs#findyourslurpeevibe@7elevenJuly 11, 2023Savoring Digital Slurpee NFTs For Slurpee lovers excited to claim these digital delights, go to slurpeevibe.7-eleven.com, scan the QR code with a mobile device, and launch the process whereby numerous Slurpee flavors arise. Then, fill the cups with digitalized icy goodness. The decision about claiming the ‘Slurpee Vibe Digital Collectible’ will appear. If not fully satisfied, simply start over again. It’s an invent-your-own adventure, and the amount of creativity is limitless. Once happy with the virtual beverage creation, it’s time to seal the deal by hitting the ‘claim now’ button and add the necessary details required: name, email address, and phone number. A six-digit code will be sent to the virtual Slurpee maker, unlocking the self-made digital asset that looks attractive enough to guzzle down. As the digital collectible is miraculously created, the digital Slurpee designer will receive a new wallet on the Polygon blockchain, presenting the tokenized asset. The secrets behind these NFTs reveal in the app’s terms of service, touching base on every nook and cranny. So, prepare your digital taste buds and welcome 7-Eleven NFTs to unleash a bit of creative flair and experience the famous Slurpee drinks like never before — cost-free!Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Starbucks Odyssey"],"image":"https://nftplazas.com/wp-content/uploads/2023/07/Starbucks-Roasts-New-Odyssey-NFTs-with-MLBs-Micah-Johnson.png","author":"Leah","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"Presenting yet another shot of innovation, Starbucks’ Odyssey NFTsStarbucks’ Odyssey NFTsstir up a fresh partnership with the AkuNFT collection, roasting new Stamps in a Journey called ‘Aku Adventure’ to energize members’ digital portfolios on July 17 to August 13, 2023.The 15,000-piece NFT profile picture project, Aku, crafted by the MLB player Micah JohnsonMLB player Micah Johnson, pours ambition into budding brains, blending potential and dreams by taking inspiration from his nephew’s fantasy of being a black astronaut. Celebrities like Trevor Noah, Pusha T, and Tyra Banks added these wholesome collectibles to their digital tables, guiding the project’s first chapter to rake in a hefty $2 million in February 2021. All members of Starbucks Odyssey NFTs will shortly be able to “join the coffee caravan club with Aku.” Starbucks’ revealed it would donate $100k of proceeds to ‘Blessing in a Backpack’, a non-profit charity fighting against food starvation among children. “I’m extremely grateful to Starbucks for supporting our mission to not just be a character that represents good but a character that actually does good,” tweeted Johnson. Starbucks’ Past Web3 AromasAfter months of build-up, Starbucks first ground itself into the blockchain realm by debuting Odyssey in March 2023. The inaugural 2,000-piece NFT ‘Siren Collection’ was guzzled in under 18 minutes, despite high demand causing lousy website access. Initially, the Stamps were available for $100. However, the assets were sold on secondary marketplaces shortly after the official sale for approximately $550 each. Following the success, the world-renowned coffee house brewed another batch of NFTs named ‘The Starbucks First Store Collection’. These 5,000 limited edition pieces, priced at $99 each and currently selling on OpenSea for approximately $118.7, were created to provide a satisfying and smooth experience for its loyal customers. All of Starbucks’ Odyssey NFTs act as points for the rewards program. Members can win the non-fungible tokens when partaking in the app’s games and online experiences and gain points when either collecting or buying the digital tokens to unlock exclusive perks: virtual coffee tours, a real-world tour around Starbucks’ Hacienda Alsacia coffee farm in Costa Rica, espresso martini-making classes, physical merchandise and more.Odyssey continues to infuse new horizons to boost customer engagement through blockchain technology with integral purposes — appealing to not only adventurous coffee enthusiasts but also those passionate about social justice. Want more? Connect with NFT PlazasJoin the Weekly NewsletterFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0},{"tags":["Gutter Cat Gang"],"image":"https://nftplazas.com/wp-content/uploads/2023/07/The-Gutter-Cat-Gang-Rocked-by-Two-Pronged-Twitter-Hack.png","author":"Russell","publishDate":"Dec 22, 2023, 12:00:00 AM","content":"internet hoodlumsGutter Cat GangGutterMelo collectionJuly 8, 2023Questions Arise Concerning the Gutter Cat Gang’s SecurityWant more? Connect with NFT PlazasJoin the Weekly NewsletterJoin our DiscordFollow us on TwitterLike us on FacebookFollow us on Instagram*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment.","react":0}]